/* 綾香思考音系
 *
 * https://ayaka.shn.hk/v8/
 *
 * @author Ayaka
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

// 1. 選項

if (!音韻地位) return [
  ['書寫系統', [3, '平假名', '片假名', '日本式羅馬字', '平文式羅馬字'], {
    description: [
      "'平假名': 地 ち",
      "'片假名': 地 チ",
      "'日本式羅馬字': 地 ti",
      "'平文式羅馬字': 地 chi"
    ].join('\n'),
  }],

  ['ヰヱヲ小假名', true, {
    description: ['true: 迥 ク𛅥ィ', 'false: 迥 クヱィ', '僅當開啓假名時生效'].join('\n'),
  }],

  ['音變', [1, { value: null, text: '無' }, '現代日語'], {
    description: [
      "'無': 宙 チウ tiu；南 ダム dam；愁 スウ suu",
      "'現代日語': 宙 チュウ tyuu；南 ダン dan；愁 スウ suu",
    ].join('\n'),
  }],

  // 參考：尉遲治平. 日本悉曇家所傳古漢語調值.
  ['聲調', [1, { value: null, text: '無' }, '四聲', '四聲（數字）', '四聲（調值）', '六聲（調值）', '六聲（符號）', '八聲', '八聲（數字）', '八聲（調值）']],
];

// 2. 輔助函數

const 假名表 = {
   a: 'ア',  i: 'イ',  u: 'ウ',  e: 'エ',  o: 'オ',
  ka: 'カ', ki: 'キ', ku: 'ク', ke: 'ケ', ko: 'コ',
  ga: 'ガ', gi: 'ギ', gu: 'グ', ge: 'ゲ', go: 'ゴ',
  sa: 'サ', si: 'シ', su: 'ス', se: 'セ', so: 'ソ',
  za: 'ザ', zi: 'ジ', zu: 'ズ', ze: 'ゼ', zo: 'ゾ',
  ta: 'タ', ti: 'チ', tu: 'ツ', te: 'テ', to: 'ト',
  da: 'ダ', di: 'ヂ', du: 'ヅ', de: 'デ', do: 'ド',
  na: 'ナ', ni: 'ニ', nu: 'ヌ', ne: 'ネ', no: 'ノ',
  pa: 'ハ', pi: 'ヒ', pu: 'フ', pe: 'ヘ', po: 'ホ',
  ba: 'バ', bi: 'ビ', bu: 'ブ', be: 'ベ', bo: 'ボ',
  ma: 'マ', mi: 'ミ', mu: 'ム', me: 'メ', mo: 'モ',
  ya: 'ヤ',           yu: 'ユ',           yo: 'ヨ',
  ra: 'ラ', ri: 'リ', ru: 'ル', re: 'レ', ro: 'ロ',
  wa: 'ワ', wi: 'ヰ',           we: 'ヱ', wo: 'ヲ',
};

const 拗音表 = {
  wya: 'ヰャ', wyo: 'ヰョ',
  ya: 'ャ', yu: 'ュ', yo: 'ョ',
  wa: 'ヮ', wi: '𛅤', we: '𛅥', wo: '𛅦',
};

const 韻尾表 = {
   '': '',   'i': 'イ',  'u': 'ウ',
  'm': 'ム', 'n': 'ン', 'ng': 'ゥ', // ng: 'ィ',
  'p': 'フ', 't': 'ツ',  'k': 'ク', // k: 'キ',
};

function roma2kata(s) {
  const r = /^([kgsztdnpbmyrw]?w??[yw]?)([aiueo])([ptkmngiu]*)$/g; // 將音節分為韻頭、主要元音及韻尾
  const match = r.exec(s);
  if (match === null) {
    throw new Error('無法轉換為假名：' + s);
  }
  const { 1: 韻頭, 2: 主要元音, 3: 韻尾 } = match;
  let 假名韻尾 = 韻尾表[韻尾];
  if (主要元音 === 'e') {
    if (韻尾 === 'k') 假名韻尾 = 'キ';
    if (韻尾 === 'ng') 假名韻尾 = 'ィ';
  }
  if (韻頭.length <= 1) {
    return 假名表[韻頭 + 主要元音] + 假名韻尾;
  }
  const 填充元音 = 韻頭[1] === 'w' ? 'u' : 'i'; // 韻頭[1] 只能為 w 或 y
  return 假名表[韻頭[0] + 填充元音] + 拗音表[韻頭.slice(1) + 主要元音] + 假名韻尾;
}

function kata2hira(s) {
  const diff = 'ぁ'.charCodeAt(0) - 'ァ'.charCodeAt(0);
  return [...s].map(c => ({
    '𛅤': '𛅐',
    '𛅥': '𛅑',
    '𛅦': '𛅒',
  }[c] ?? String.fromCharCode(c.charCodeAt(0) + diff))).join('');
}

function small2large(s) {
  return [...s].map(c => ({
    '𛅤': 'ヰ',
    '𛅥': 'ヱ',
    '𛅦': 'ヲ',
  }[c] ?? c)).join('');
}

// 3. 推導規則

function 聲母規則() {
  return when([
    // 脣音
    ['幫滂並母', 'p'],
    ['明母', [
      ['梗攝 非 (庚耕青韻 入聲)', 'm'],
      ['', 'b'],
    ]],

    // 舌音、半舌音
    ['端透定知徹澄母', 't'],
    ['泥孃母', [
      ['梗攝', 'n'],
      ['', 'd'],
    ]],
    ['來母', 'r'],

    // 齒音、半齒音
    ['精莊章組', 's'],
    ['日母', 'z'],

    // 牙音、喉音
    ['見溪羣曉匣母', 'k'],
    ['疑母', 'g'],
    ['影云以母', '']

  ], '無聲母規則');
}

function 韻母規則() {
  return when([
    ['通攝', [
      ['一等', 'ong'],
      ['東韻', [
        ['脣音', [['幫滂並母 入聲', 'uk'], ['', 'ong']]],
        ['精莊章組', 'yung'],
        ['', [
          ['舒聲', 'yung'],
          ['入聲 影母', 'wik'],
          ['入聲', 'ik']
        ]],
      ]],
      ['鍾韻', [
        ['脣音', 'ong'],
        ['', 'yong'],
      ]],
    ]],

    ['止攝', [
      ['合口', [
        ['舌齒音', 'ui'],
        ['牙喉音', 'wi'],
      ]],
      ['', 'i'],
    ]],

    ['遇攝', [
      ['魚韻', [
        ['莊組', 'o'],
        ['', 'yo'],
      ]],
      ['虞韻', [
        ['鈍音 或 莊組 或 來母', 'u'],
        ['知組', 'yuu'],
        ['', 'yu'],
      ]],
      ['一等', [
        ['影母', 'wo'],
        ['', 'o'],
      ]],
    ]],

    ['蟹攝', [
      ['三四等', [
        ['廢韻 平上聲 章組', 'ai'],
        ['廢韻 合口', 'wai'],
        ['合口', 'wei'],
        ['', 'ei'],
      ]],
      ['一二等', [
        ['合口', 'wai'],
        ['', 'ai'],
      ]],
    ]],

    ['臻攝', [
      ['三四等', [
        ['文韻', 'un'],
        ['合口', [
          ['莊組', [['舒聲', 'on'], ['', 'it']]],
          ['舌齒音 非 來母', [['舒聲', 'yun'], ['', 'ot']]],
          ['云母', 'win'],
          ['', 'in'],
        ]],
        ['', 'in'],
      ]],
      ['一等', 'on'],
    ]],

    ['山攝', [
      ['一二等 或 脣音 C類', [
        ['合口', 'wan'],
        ['', 'an'],
      ]],
      ['三四等', [
        ['合口', 'wen'],
        ['', 'en'],
      ]],
    ]],

    ['效攝', [
      ['三四等', 'eu'],
      ['二等', 'au'],
      ['一等', [
        ['脣音', 'ou'],
        ['', 'au'],
      ]],
    ]],

    ['果假攝', [
      ['一二等 或 脣音 C類', [
        ['合口', 'wa'],
        ['', 'a'],
      ]],
      ['三四等', [
        ['合口', 'wa'],
        ['', 'ya'],
      ]],
    ]],

    ['宕江攝', [
      ['三四等', [
        ['合口', [
          ['舌齒音', 'ang'],
          ['影云母', 'wang'],
          ['牙喉音', 'wyang'],
        ]],
        ['幫莊組', 'ang'],
        ['', 'yang'],
      ]],
      ['一二等', [
        ['合口', 'wang'],
        ['', 'ang'],
      ]],
    ]],

    ['梗攝', [
      ['三四等', [
        ['合口', 'weng'],
        ['', 'eng'],
      ]],
      ['二等', [
        ['合口', 'wang'],
        ['', 'ang'],
      ]],
    ]],

    ['曾攝', [
      ['三四等', [
        ['合口', [
          ['牙音 或 曉匣母', 'wyong'],
          ['', 'yong'],
        ]],
        ['莊組', 'ong'],
        ['', 'yong'],
      ]],
      ['一等', 'ong'],
    ]],

    ['流攝', [
      ['三四等', [
        ['脣音 AB類', 'iu'],
        ['明母', 'ou'],
        ['幫莊組', 'uu'],
        ['', 'iu'],
      ]],
      ['一等', 'ou'],
    ]],

    ['深攝', 'im'],

    ['咸攝', [
      ['一二等 或 脣音 C類', 'am'],
      ['三四等', 'em'],
    ]],
  ], '無韻母規則');
}

let 聲母 = 聲母規則();
let 韻母 = 韻母規則();

if (is`入聲`) {
  if (韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'p';
  else if (韻母.endsWith('n')) 韻母 = 韻母.slice(0, -1) + 't';
  else if (韻母.endsWith('ng')) 韻母 = 韻母.slice(0, -2) + 'k';
}

function 聲調規則() {
  if (['四聲', '四聲（數字）', '四聲（調值）'].includes(選項.聲調)) {
    return {
      '平': ['꜀', '1', '11'],
      '上': ['꜂', '2', '55'],
      '去': ['꜄', '3', '15'],
      '入': ['꜆', '4', '1'],
    }[音韻地位.聲][['四聲', '四聲（數字）', '四聲（調值）'].indexOf(選項.聲調)];
  }

  if (選項.聲調 === '六聲（調值）') {
    return when([
      ['平聲 全濁', '11'],
      ['平聲', '51'],
      ['上去聲 全濁', '15'],
      ['上去聲', '55'],
      ['入聲 全濁', '1'],
      ['入聲', '5'],
    ], '無聲調規則');
  }

  if (選項.聲調 === '六聲（符號）') {
    if (is`入聲 全濁`) {
      if (韻母.endsWith('p')) 韻母 = 韻母.slice(0, -1) + 'b';
      else if (韻母.endsWith('t')) 韻母 = 韻母.slice(0, -1) + 'd';
      else if (韻母.endsWith('k')) 韻母 = 韻母.slice(0, -1) + 'g';
      return '';
    }
    return when([
      ['平聲 全濁', 'z'],
      ['平聲', ''],
      ['上去聲 全濁', 'h'],
      ['上去聲', 'x'],
      ['入聲', ''],
    ], '無聲調規則');
  }

  if (['八聲', '八聲（數字）', '八聲（調值）'].includes(選項.聲調)) {
    return [
      { // 陰
        '平': ['꜀', '1', '51'],
        '上': ['꜂', '2', '55'],
        '去': ['꜄', '3', '535'],
        '入': ['꜆', '4', '5'],
      },
      { // 陽
        '平': ['꜁', '5', '11'],
        '上': ['꜃', '6', '15'],
        '去': ['꜅', '7', '315'],
        '入': ['꜇', '8', '1'],
      }
    ][+is`全濁`][音韻地位.聲][['八聲', '八聲（數字）', '八聲（調值）'].indexOf(選項.聲調)];
  }

  return '';
}

let 聲調 = 聲調規則();

if (韻母.startsWith('w') && is`非 牙喉音 或 A類 或 以母`) 韻母 = 韻母.slice(1);

// 4. 音變規則

if (選項.音變 === '現代日語') {
  const 韻母轉換規則字典 = [
    ['w', ''], // 園 wen -> en
    ['p', 'u'], // 鄴 gep -> geu
    ['m', 'n'], // 南 dam -> dan
    ['eng', 'ei'], // 生 seng -> sei
    ['ng', 'u'], // 相 syang -> syau
    ['au', 'ou'], // 高 kau -> kou
    ['iu', 'yuu'], // 宙 tiu -> tyuu
    ['eu', 'you'], // 遙 eu -> you
  ];
  韻母轉換規則字典.forEach(pair => 韻母 = 韻母.replace(...pair));

  if (聲母 === 'd' && /^[iy]/.test(韻母)) 聲母 = 'z'; // 膩 di -> zi, 紐 dyuu -> zyuu
}

let 聲韻 = 聲母 + 韻母;

if (['平假名', '片假名'].includes(選項.書寫系統)) {
  聲韻 = roma2kata(聲韻);
  if (!選項.ヰヱヲ小假名) 聲韻 = small2large(聲韻);
  if (選項.書寫系統 === '平假名') 聲韻 = kata2hira(聲韻);
} else if (選項.音變 === '現代日語') {
  聲韻 = 聲韻.replace('p', 'h'); // 甫 pu -> hu

  if (聲韻.endsWith('t')) 聲韻 += 'u'; // 遏 at -> atu
  else if (聲韻.endsWith('ek')) 聲韻 += 'i'; // 席 sek -> seki
  else if (聲韻.endsWith('k')) 聲韻 += 'u'; // 澤 tak -> taku

  if (選項.書寫系統 === '平文式羅馬字') {
    const 聲韻轉換規則字典 = [
      [/s(y|(?=i))/, 'sh'], // 四 si -> shi, 小 syou -> shou
      [/z(y|(?=i))/, 'j'], // 人 zin -> jin, 繞 zyou -> jou
      [/t(y|(?=i))/, 'ch'], // 地 ti -> chi, 兆 tyou -> chou
      [/t(?=u)/, 'ts'], // 追 tui -> tsui, 遏 atu -> atsu
      [/^h(?=u)/, 'f'], // 甫 hu -> fu
    ];
    聲韻轉換規則字典.forEach(pair => 聲韻 = 聲韻.replace(...pair));
  }
}

return [...'꜀꜁꜂꜃'].includes(聲調) ? 聲調 + 聲韻 : 聲韻 + 聲調;
