/* 推導《東國正韻》式漢字音
 *
 * https://zhuanlan.zhihu.com/p/616644846
 *
 * 申叔舟, 崔恆, 成三問, et al, 1448(朝鮮正統十三年). 東國正韻[M/OL]. 漢城: [s.n.]. https://commons.wikimedia.org/wiki/Category:Dictionary_of_Korean_Pronunciation_of_Chinese_Letters.
 * 申祐先, 2014. 韓國語漢字音歷史層次研究[D/OL]. 臺北: 國立臺灣大學. https://archive.org/details/woosun_shin_2014.
 * 福井玲, 2015. 中世韓国語の「傍点」をめぐるいくつかの基本的な課題[J/OL]. 言語研究(148): 61-80. http://www.ls-japan.org/modules/documents/LSJpapers/journals/148_fukui.pdf.
 *
 * @author Mishiro
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  ['推導原書部分例外讀音', true],
  ['推導現代讀音', false],
].concat(選項.推導現代讀音 ? [
  ['應用頭音法則', false],
  ['標記長音', 選項.注音方案 !== '文觀部轉寫' ? false : null],
  ['注音方案', [1, '諺文', '文觀部轉寫']],
] : [
  ['注音方案', [1, '諺文', '福井玲轉寫']],
  ['標調方式', 選項.注音方案 === '福井玲轉寫' ? [2, '上標', '後綴'] : null],
]);

const 例外 = 選項.推導原書部分例外讀音;
const 現代 = 選項.推導現代讀音;

const 轉寫 = {
  // 基於福井玲（2015），有增補
  '福井玲轉寫': {
    ᄀ: 'k', ᄏ: 'kʰ', ᄁ: 'kk', ᅌ: 'ŋ',
    ᄃ: 't', ᄐ: 'tʰ', ᄄ: 'tt', ᄂ: 'n', ᄅ: 'r',
    ᄇ: 'p', ᄑ: 'pʰ', ᄈ: 'pp', ᄆ: 'm',
    ᄌ: 'c', ᄎ: 'cʰ', ᄍ: 'cc',
    ᄉ: 's', 　        ᄊ: 'ss', ᅀ: 'z',
    ᅙ: 'q', ᄒ: 'h',  ᅘ: 'hh', ᄋ: '’',

    ᆞ: 'ʌ', ᆡ: 'ʌi',
    ᅳ: 'ɨ', ᅴ: 'ɨi',
    ᅵ: 'i',
    ᅩ: 'o', ᅬ: 'oi', ᅭ: 'jo',
    ᅡ: 'a', ᅢ: 'ai', ᅣ: 'ja', 　         ᅪ: 'wa', ᅫ: 'wai',
    ᅮ: 'u', ᅱ: 'ui', ᅲ: 'ju', ᆔ: 'jui',
    ᅥ: 'e', 　        ᅧ: 'je', ᅨ: 'jei', ᅯ: 'we', 　         ᆑ: 'jwe', ᆒ: 'jwei',

    ᇰ: 'ŋ', ᆨ: 'k', ᆫ: 'n', ᇙ: 'rq', ᆷ: 'm', ᆸ: 'p', ᇢ: 'w', ᆼ: '’',
  },

  '文觀部轉寫': {
    ᄀ: 'g', ᄂ: 'n', ᄃ: 'd', ᄅ: 'r', ᄆ: 'm', ᄇ: 'b', ᄉ: 's', ᄋ: '', ᄌ: 'j', ᄒ: 'h',

    　        ᅡ: 'a',  ᅢ: 'ae',  　         ᅣ: 'ya',
    　        ᅥ: 'eo', ᅦ: 'e',   　         ᅧ: 'yeo', ᅨ: 'ye',
    ᅩ: 'o',  ᅪ: 'wa', ᅫ: 'wae', ᅬ: 'oe',  ᅭ: 'yo',
    ᅮ: 'u',  ᅯ: 'wo', 　         ᅱ: 'wi',  ᅲ: 'yu',
    ᅳ: 'eu', 　        　         ᅴ: 'ui',
    ᅵ: 'i',

    ᆼ: 'ng', ᆨ: 'k', ᆫ: 'n', ᆯ: 'l', ᆷ: 'm', ᆸ: 'p',
  },
};

function 音變(音節) {
  function 替換(key, rule, condition = true) {
    if (condition) Object.entries(rule).forEach(([k, v]) => {
      音節[key] = 音節[key].replace(k, v);
    });
  }
  替換('初聲', {
    ᄏ: 'ᄀ', ᄐ: 'ᄃ', ᄑ: 'ᄇ', ᄎ: 'ᄌ',
    ᄁ: 'ᄀ', ᄄ: 'ᄃ', ᄈ: 'ᄇ', ᄍ: 'ᄌ', ᄊ: 'ᄉ', ᅘ: 'ᄒ',
    ᅌ: 'ᄋ', ᅙ: 'ᄋ', ᅀ: 'ᄋ',
  });
  替換('中聲', { ᆞ: 'ᅡ', ᆡ: 'ᅢ', ᆔ: 'ᅲ', ᆑ: 'ᅧ', ᆒ: 'ᅨ' });
  替換('終聲', { ᇢ: '', ᆼ: '', ᇰ: 'ᆼ', ᇙ: 'ᆯ' });
  替換('初聲', { ᄅ: 'ᄂ' }, 選項.應用頭音法則);
  替換('初聲', { ᄂ: 'ᄋ' }, 'ᅵᅭᅣᅲᅧᅨ'.includes(音節.中聲) && 選項.應用頭音法則);
  替換('初聲', { ᄃ: 'ᄌ' }, 'ᅵᅭᅣᅲᅧᅨ'.includes(音節.中聲));
  替換('中聲', { ᅭ: 'ᅩ', ᅣ: 'ᅡ', ᅲ: 'ᅮ', ᅧ: 'ᅥ', ᅨ: 'ᅦ' }, 'ᄌᄉ'.includes(音節.初聲));
  替換('中聲', { ᅳ: 'ᅮ' }, 'ᄇᄆ'.includes(音節.初聲));
  替換('中聲', { ᅴ: 'ᅵ' }, !'ᄒᄋ'.includes(音節.初聲));
  替換('中聲', { ᅪ: 'ᅡ', ᅫ: 'ᅢ' }, !'ᄀᄒᄋ'.includes(音節.初聲));
  替換('中聲', { ᅱ: 'ᅮ' }, 音節.終聲);
}

function 聲母() {
  return when([
    [例外, [
      ['疑母', [
        ['齊韻 上聲 或 先韻 平上聲 或 蕭韻 去聲 或 青韻 入聲', 'ᅌ'],
        ['耕韻 去聲', 'ᄋ'],
      ]],
      ['滂母 凡韻', 'ᄇ'],
      ['崇母 (通效假宕攝 或 尤韻 平聲)', 'ᄊ'],
      ['云母', [
        ['蒸韻', 'ᅙ'],
        ['支脂之韻 仄聲 或 仙韻 開口 或 侵韻 入聲', 'ᄋ'],
      ]],
    ]],

    ['崇母 止攝', 'ᄊ'],
    ['云母 通攝 舒聲', 'ᅘ'],
    ['疑母 (四等 或 重紐A類 或 幽韻)', 'ᄋ'],
    ['', {
      // 牙音
      見: 'ᄀ', 溪: 'ᄏ', 羣: 'ᄁ', 疑: 'ᅌ',
      // 舌音
      端: 'ᄃ', 透: 'ᄐ', 定: 'ᄄ', 泥: 'ᄂ',
      知: 'ᄃ', 徹: 'ᄐ', 澄: 'ᄄ', 孃: 'ᄂ',
      // 脣音
      幫: 'ᄇ', 滂: 'ᄑ', 並: 'ᄈ', 明: 'ᄆ',
      // 齒音
      精: 'ᄌ', 清: 'ᄎ', 從: 'ᄍ', 心: 'ᄉ', 邪: 'ᄊ',
      莊: 'ᄌ', 初: 'ᄎ', 崇: 'ᄍ', 生: 'ᄉ', 俟: 'ᄊ',
      章: 'ᄌ', 昌: 'ᄎ', 常: 'ᄊ', 書: 'ᄉ', 船: 'ᄊ',
      // 喉音
      影: 'ᅙ', 曉: 'ᄒ', 匣: 'ᅘ', 云: 'ᅌ', 以: 'ᄋ',
      // 半舌音
      來: 'ᄅ',
      // 半齒音
      日: 'ᅀ',
    }[音韻地位.母]],
  ], '無初聲規則', true);
}

function 韻母(輸出) {
  const 韻母字典 = {
    曾開: { 中聲: 'ᅵ ᅳ ᅳ ᅳ', 終聲: 'ᇰ' },
    曾合: { 中聲: '〇 ᆑ 〇 ᅱ', 終聲: 'ᇰ' },
    梗開: { 中聲: 'ᅧ ᅧ ᆡ 〇', 終聲: 'ᇰ' },
    梗合: { 中聲: 'ᆑ ᆑ ᅬ 〇', 終聲: 'ᇰ' },
    通開: { 中聲: 'ᅲ ᅮ ᅲ ᅩ', 終聲: 'ᇰ' }, // 東冬韻
    通合: { 中聲: 'ᅭ ᅩ 〇 ᅩ', 終聲: 'ᇰ' }, // 鍾韻
    宕開: { 中聲: 'ᅣ ᅣ ᅡ ᅡ', 終聲: 'ᇰ' }, // 江陽唐韻
    宕合: { 中聲: '〇 ᅪ ᅪ ᅪ', 終聲: 'ᇰ' },

    臻開: { 中聲: 'ᅵ ᅳ ᅳ ᆞ', 終聲: 'ᆫ' },
    臻合: { 中聲: 'ᅲ ᅮ ᅩ ᅩ', 終聲: 'ᆫ' },
    山開: { 中聲: 'ᅧ ᅥ ᅡ ᅡ', 終聲: 'ᆫ' },
    山合: { 中聲: 'ᆑ ᅯ ᅪ ᅪ', 終聲: 'ᆫ' },

    深開: { 中聲: 'ᅵ ᅳ ᆞ 〇', 終聲: 'ᆷ' },
    咸開: { 中聲: 'ᅧ ᅥ ᅡ ᅡ', 終聲: 'ᆷ' },

    效開: { 中聲: 'ᅭ ᅭ ᅭ ᅩ', 終聲: 'ᇢ' },
    流開: { 中聲: 'ᅲ ᅮ ᅮ ᅮ', 終聲: 'ᇢ' },

    止開: { 中聲: 'ᅵ ᅴ ᆞ ᆞ', 終聲: 'ᆼ' },
    止合: { 中聲: 'ᆔ ᅱ ᆔ 〇', 終聲: 'ᆼ' },
    蟹開: { 中聲: 'ᅨ ᅨ ᅢ ᆡ', 終聲: 'ᆼ' },
    蟹合: { 中聲: 'ᆒ ᆒ ᅫ ᅬ', 終聲: 'ᆼ' },
    遇開: { 中聲: 'ᅧ ᅥ ᅩ 〇', 終聲: 'ᆼ' }, // 魚韻
    遇合: { 中聲: 'ᅲ ᅮ ᅮ ᅩ', 終聲: 'ᆼ' }, // 虞模韻
    果開: { 中聲: 'ᅣ ᅣ ᅡ ᅡ', 終聲: 'ᆼ' }, // 歌麻韻
    果合: { 中聲: 'ᅪ ᅪ ᅪ ᅪ', 終聲: 'ᆼ' },
  };

  let 等 = when([
    ['精組 止攝 開口', '一'],
    ['莊組', '二'],
    ['非 三等', 音韻地位.等],

    ['幫組', [
      ['東鍾歌陽韻 非 重紐A類', '一'],
      ['微廢韻', '四'],
      ['重紐B類 非 侵韻 或 蒸幽韻', '四'],
    ]],
    ['銳音 或 重紐A類 或 麻幽韻 非 重紐B類', '四'],
    ['', '三'],
  ], '無等規則', true);
  let 開合 = when([
    ['鍾虞模韻', '合'],
    ['江韻 銳音', '合'],
    ['文魂韻 幫組', '合'],
    ['', 音韻地位.呼 ?? '開'],
  ], '無開合規則', true);

  let 韻母 = 韻母字典[(is`江韻` ? '宕' : is`元韻` ? '山' : is`麻韻` ? '果' : 音韻地位.攝) + 開合];
  let 中聲 = when([
    [例外, [
      ['東韻 云曉母 三等 入聲', 'ᅲ'],
      ['鍾韻', [
        ['孃母 平聲 或 書來母 入聲', 'ᅩ'],
        ['羣母 入聲', 'ᅮ'],
        ['澄曉母 舒聲', 'ᅲ'],
      ]],
      ['江韻 徹初母 入聲', 'ᅡ'],
      ['脂韻 合口', [
        ['知母 去聲', 'ᅱ'],
        ['云母 上聲', 'ᆔ'],
      ]],
      ['之韻 崇母 平聲', 'ᅵ'],
      ['虞韻', [
        ['來母', 'ᅮ'],
        ['生母 上聲', 'ᅲ'],
      ]],
      ['佳韻 匣母 合口 上聲', 'ᅢ'],
      ['咍韻 (見組 或 泥母)', 'ᅢ'],
      ['廢韻 昌母', 'ᆡ'],
      ['眞韻', [
        ['開口 (影母 入聲 或 曉母 去聲)', 'ᅵ'],
        ['合口 牙喉音 非 (見母 重紐B類)', 'ᅲ'], // 無重紐對立一律按四等讀
      ]],
      ['元韻 影母 開口 平聲', 'ᅧ'],
      ['痕韻 匣母', is`舒聲` ? 'ᅳ' : 'ᅩ'],
      ['仙韻', [
        ['開口 (見母 或 溪母 去聲)', 'ᅥ'],
        ['開口 (疑母 上聲 或 影曉母 平聲)', 'ᅧ'],
        ['合口 來母 非 入聲', 'ᅯ'],
      ]],
      ['肴韻 崇母', 'ᅩ'],
      ['歌韻 來母 去聲', 'ᅪ'],
      ['陽韻 莊母 入聲', 'ᅣ'],
      ['庚韻 開口 二等 (澄母 上聲 或 曉母)', 'ᅧ'],
      ['耕韻 (見母 開口 或 疑母 去聲 或 明母 上聲)', 'ᅧ'],
      ['青韻 曉母 開口 入聲', 'ᆑ'],
      ['蒸韻', [
        ['精從來母 或 以母 舒聲', 'ᅳ'],
        ['曉母 開口 入聲', 'ᅵ'],
        ['生母', is`舒聲` ? 'ᅵ' : 'ᆡ'],
        ['幫組 入聲', 'ᅧ'],
      ]],
      ['登韻 匣母 合口', 'ᅬ'],
      ['流攝 三等 曉母', 'ᅲ'],
      ['尤韻 滂母 平聲', 'ᅲ'],
      ['侯韻 泥母', 'ᅲ'],
      ['幽韻 羣母 上聲', 'ᅮ'],
      ['侵韻', [
        ['重紐A類 或 以母', 'ᅳ'],
        ['初母 上去聲', 'ᅵ'],
      ]],
      ['鹽韻 云母', 'ᅧ'],
    ]],

    ['止攝 莊初母 開口', 'ᅴ'],
    ['祭韻 合口 (重紐B類 或 云母)', 'ᅱ'],
    ['泰韻 非 合口', 'ᅢ'],
    ['肴韻 幫組', 'ᅩ'],
    ['陽韻 見組 開口', 'ᅡ'],
    ['', 韻母.中聲.split(' ')['四三二一'.indexOf(等)]],
  ], '無中聲規則', true);
  let 終聲 = is`舒聲` ? 韻母.終聲 : { ᆷ: 'ᆸ', ᆫ: 'ᇙ', ᇰ: 'ᆨ' }[韻母.終聲];

  return { 中聲, 終聲 };
}

let 音節 = {
  初聲: 聲母(),
  ...韻母()
};
if (現代) 音變(音節);

function 聲調() {
  if (現代) return 選項.標記長音 && is`上去聲` ? 'ː' : '';
  return {
    諺文: { 平: '', 上: '〯', 去: '〮', 入: '〮' },
    福井玲轉寫: 選項.標調方式 === '上標' ?
    { 平: '̀', 上: '̌', 去: '́', 入: '́' } :
    { 平: 'ᴸ', 上: 'ᴿ', 去: 'ᴴ', 入: 'ᴴ' },
  }[選項.注音方案][音韻地位.聲];
}

音節 = 音節.初聲 + 音節.中聲 + 音節.終聲;
if (選項.注音方案 !== '諺文') Object.entries(轉寫[選項.注音方案]).forEach(([k, v]) => {
  音節 = 音節.replace(k, v);
});
if (選項.標調方式 === '上標') return 音節.replace(/.*[ʌɨoaue]|.*i/, "$&" + 聲調());
return 音節 + 聲調();
