/* 推導日本語吳音
 *
 * https://jgrammar.life.coocan.jp/ja/data/ksound.htm
 * https://ksu.repo.nii.ac.jp/record/1280/files/AHSUSK_HS_37_133.pdf
 * https://sozysozbot.github.io/kanzihom_taihogxeu/%E5%AF%BE%E5%BF%9C%E8%A1%A8.html
 * https://www.bilibili.com/read/cv7596219
 *
 * @author 小月の完美中文敎室
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [];

function 聲母規則() {
  return when([
    ['並母', 'b'],
    ['明母', 'm'],
    ['脣音', 'h'],

    ['泥孃日母', 'n'],
    ['定澄母', 'd'],
    ['來母', 'r'],
    ['舌音', 't'],

    ['齒音 濁音', 'z'],
    ['齒音', 's'],

    ['匣母 合口 果蟹梗曾宕攝 非 青韻', ''],
    ['羣疑匣母', 'g'],
    ['影云以母', ''],
    ['牙喉音', 'k'],
  ], '無聲母規則');
}

function 韻腹規則() {
  return when([
	// 果假攝
    ['果攝', [['合口 牙喉音', 'wa'], ['三等', 'ya'], ['', 'a']]],
    ['假攝', [['三等 或 齒音', 'ya'], ['脣舌音', 'a'], ['', 'e']]],
	// 遇攝
    ['模韻', [['明母 或 齒牙喉音', 'o'], ['', 'u']]],
    ['魚韻', [['鈍音 或 來精清從心初母', 'o'], ['', 'yo']]],
    ['虞韻', [['知精莊組 或 常日以母', 'yu'], ['', 'u']]],
	// 蟹攝
    ['蟹攝 合口 牙喉音', 'e'],
    ['祭韻', [['精組', 'a'], ['', 'e']]],
    ['齊韻', [['舌齒音', 'a'], ['', 'e']]],
    ['蟹攝', 'a'],
	// 止攝
    ['止攝', [['合口 以母', 'yu'], ['合口 銳音', 'u'], ['開口 之韻 見組', 'o'], ['開口 微韻 牙喉音', 'e'], ['', 'i']]],
	// 效攝
    ['豪韻', 'o'],
    ['效攝', 'yo'],
	// 流攝
    ['侯韻', [['精組', 'o'], ['', 'u']]],
    ['尤韻', [['鈍音 或 來母', 'u'], ['', 'yu']]],
    ['幽韻', 'yo'],
	// 咸攝
    ['覃韻 泥來母 舒聲', 'a'],
    ['談韻', [['入聲', 'o'], ['', 'a']]],
    ['覃嚴凡韻', 'o'],
    ['咸銜鹽添韻', [['入聲', 'yo'], ['', 'e']]],
	// 深攝
    ['深攝', [['鈍音', 'o'], ['入聲','yu'], ['', 'i']]],
	// 山攝
    ['寒韻', 'a'],
    ['刪山韻', [['脣音 入聲', 'a'], ['', 'e']]],
    ['仙先韻', 'e'],
    ['元韻', 'o'],
	// 臻攝
    ['痕魂殷韻', 'o'],
    ['文韻', [['脣音 入聲 或 明母', 'o'], ['', 'u']]],
    ['臻攝', [['莊組 合口', 'o'], ['舌齒音 合口 非 來母', 'yu'], ['', 'i']]],
	// 梗攝
    ['梗攝', [['入聲 匣母 二等 合口', 'wa'], ['入聲', 'ya'], ['匣母 二等 合口', 'o'], ['', 'yo']]],
	// 曾攝
    ['登韻', [['入聲 匣母 合口', 'wa'], ['', 'o']]],
    ['蒸韻 入聲', [['精見影組', 'o'], ['脣音 或 以母', 'yo'], ['', 'i']]],
    ['蒸韻', [['精組 或 影曉母', 'o'], ['', 'yo']]],
	// 宕攝
    ['唐韻', [['入聲 合口', 'wa'], ['入聲', 'a'], ['', 'o']]],
    ['陽韻 入聲', [['合口', 'wa'], ['脣音', 'a'], ['', 'ya']]],
    ['陽韻', [['合口 影云母 或 脣音 或 開口 精見影組', 'o'], ['', 'yo']]],
	// 江攝
    ['江攝', [['入聲', 'a'], ['', 'o']]],
	// 通攝
    ['通攝 一等', [['舒聲 (東韻 舌音 或 鈍音)', 'u'], ['', 'o']]],
    ['東韻 入聲', [['明來母', 'o'], ['脣音', 'u'], ['', 'i']]],
    ['鍾韻 入聲', [['日母', 'i'], ['以母', 'yo'], ['', 'o']]],
    ['通攝', [['鈍音', 'u'], ['', 'yu']]],
  ], '無韻腹規則');
}

function 韻尾規則() {
  return when([
    ['虞尤韻 (舌音 或 日母)', 'u'],
    ['蟹攝', [['合口 鈍音', ''], ['', 'i']]],
    ['止攝 合口 銳音', 'i'],
    ['果假遇止攝', ''],
    ['侯韻 非 精組', ''],
    ['尤韻', ''],
    ['效流攝', 'u'],
    ['咸深攝', [['入聲', 'u'], ['', 'n']]],
    ['山臻攝', [['入聲', 'ti'], ['', 'n']]],
    ['梗曾宕江通攝', [['入聲', 'ku'], ['', 'u']]],
  ], '無韻尾規則');
}

let 聲母 = 聲母規則();
let 韻腹 = 韻腹規則();
let 韻尾 = 韻尾規則();

if (is`蒸韻 入聲` && 韻腹 == 'i') 韻尾 = 'ki';
if (聲母 != '' || 韻腹[1] != 'a') 韻腹 = 韻腹.replace('w', '');

let 假名 = 聲母 + 韻腹;

假名 = { a: 'あ', i: 'い', u: 'う', e: 'え', o: 'お', ya: 'や', yu: 'ゆ', yo: 'よ',
  ka: 'か', ki: 'き', ku: 'く', ke: 'け', ko: 'こ', kya: 'きゃ', kyu: 'きゅ', kyo: 'きょ',
  ga: 'が', gi: 'ぎ', gu: 'ぐ', ge: 'げ', go: 'ご', gya: 'ぎゃ', gyu: 'ぎゅ', gyo: 'ぎょ',
  sa: 'さ', si: 'し', su: 'す', se: 'せ', so: 'そ', sya: 'しゃ', syu: 'しゅ', syo: 'しょ',
  za: 'ざ', zi: 'じ', zu: 'ず', ze: 'ぜ', zo: 'ぞ', zya: 'じゃ', zyu: 'じゅ', zyo: 'じょ',
  ta: 'た', ti: 'ち', tu: 'つ', te: 'て', to: 'と', tya: 'ちゃ', tyu: 'ちゅ', tyo: 'ちょ',
  da: 'だ', di: 'ぢ', du: 'づ', de: 'で', do: 'ど', dya: 'ぢゃ', dyu: 'ぢゅ', dyo: 'ぢょ',
  na: 'な', ni: 'に', nu: 'ぬ', ne: 'ね', no: 'の', nya: 'にゃ', nyu: 'にゅ', nyo: 'にょ',
  ha: 'は', hi: 'ひ', hu: 'ふ', he: 'へ', ho: 'ほ', hya: 'ひゃ', hyu: 'ひゅ', hyo: 'ひょ',
  ba: 'ば', bi: 'び', bu: 'ぶ', be: 'べ', bo: 'ぼ', bya: 'びゃ', byu: 'びゅ', byo: 'びょ',
  ma: 'ま', mi: 'み', mu: 'む', me: 'め', mo: 'も', mya: 'みゃ', myu: 'みゅ', myo: 'みょ',
  ra: 'ら', ri: 'り', ru: 'る', re: 'れ', ro: 'ろ', rya: 'りゃ', ryu: 'りゅ', ryo: 'りょ',
  wa: 'わ', wi: 'ゐ',      　   we: 'ゑ', wo: 'を'}[假名] ?? 假名;

韻尾 = { i: 'い', u: 'う', ki: 'き', ku: 'く', ti: 'ち', tu: 'つ', n: 'ん' }[韻尾] ?? 韻尾;

return 假名 + 韻尾;
