/* 推導日本語漢音舊
 *
 * 以字音假名遣形式表示，拗音用對應小假名表示；有選項可控制：分mn尾、ゐゑ合拗音、ゐゑ小假名、狂：ク𛅥ャウ／キャウ
 *
 * https://jgrammar.life.coocan.jp/ja/data/ksound.htm
 * https://ksu.repo.nii.ac.jp/record/1280/files/AHSUSK_HS_37_133.pdf
 *
 * 已知問題：
 *
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

// const 選項 = {};
  // 假名寫法
// 選項.假名 = true; // 開：カン　關：kan
// 選項.小假名 = true; // 開：キャウ　關：キヤウ
// 選項.小假名ゐゑ = true; // 開：ク𛅥ン　關：クヱン
// if (!選項.小假名)
//    選項.小假名ゐゑ = false;
  // 音變規則
// 選項.ぢづ = true; // 開：ぢづ　關：じず
// 選項.あお段合口 = true; // 開：くゎ、わ　關：か、わ
// 選項.いえ段合口 = true; // 開：ク𛅥ン　關：ケン
// 選項.分mn尾 = true; // 開：カム　關：カン
// 選項.小假名ŋ尾 = false; // 開：カゥ　關：カウ
// 選項.p尾 = true; // 開：かふ　關：かう
// 選項.分u尾韻 = true; // 開：あう、えう　關：おう、よう

function 聲母規則() {
  return when([
    ['明母', [['梗攝 舒聲', 'm'], ['', 'b']]],
    ['脣音', 'f'],

    ['泥孃母', [['梗攝', 'n'], ['', 'd']]],
    ['來母', 'r'],
    ['舌音', 't'],

    ['日母', 'z'],
    ['齒音', 's'],

    ['疑母', 'g'],
    ['影云以母', '0'],
    ['牙喉音', 'k'],
  ], '無聲母規則');
}

function 韻母規則() {
  return when([
	// 果假攝
    ['果假攝', [['合口', 'wa'], ['一二等 或 脣音 果攝', 'a'], ['', 'ya']]],
	// 遇攝
    ['模韻', [['影母', 'wo'], ['', 'o']]], // 汚 wo
    ['魚韻', [['莊組', 'o'], ['', 'yo']]],
    ['虞韻', [['幫莊見影組 或 來母', 'u'], ['知組', 'yuu'], ['', 'yu']]],
	// 蟹攝
    ['祭齊韻', [['合口', 'wei'], ['', 'ei']]],
    ['蟹攝', [['合口', 'wai'], ['', 'ai']]],
	// 止攝
    ['止攝 合口', [['舌齒音', 'ui'], ['牙喉音', 'wi']]], // 水 すい｜類 るい｜對 つい
    ['止攝', 'i'],
	// 效攝
    ['豪韻 脣音', 'ou'],
    ['豪肴韻', 'au'],
    ['宵蕭韻', 'eu'],
	// 流攝
    ['侯韻', 'ou'],
    ['尤韻', [['明母', 'ou'], ['脣音', 'uu'], ['', 'iu']]],
    ['幽韻', 'iu'],
	// 咸攝
    ['鹽嚴添韻', 'em'],
    ['咸攝', 'am'],
	// 深攝
    ['深攝', 'im'],
	// 山攝
    ['寒刪山韻', [['合口', 'wan'], ['', 'an']]],
    ['元韻 脣音', 'an'],
    ['山攝', [['合口', 'wen'], ['', 'en']]],
	// 臻攝
    ['痕魂韻', 'on'],
    ['文韻', 'un'],
    //['諄韻 合口', [['來母 或 A類', 'in'], ['', 'yun']]],
    ['真韻 合口 非 來母', [['莊組', 'on'], ['舌齒音', 'yun'], ['', 'win']]],
    ['真臻殷韻', 'in'],
	// 梗攝
    ['梗攝 二等', [['合口', 'waŋ'], ['', 'aŋ']]],
    ['梗攝 合口', 'weŋ'],
    ['梗攝', 'eŋ'],
	// 曾攝
    ['登韻', 'oŋ'],
    ['蒸韻', [['合口 牙喉音 非 云母', 'wyoŋ'], ['開口 莊組', 'oŋ'], ['', 'yoŋ']]],
	// 宕江攝
    ['陽韻 合口', [['影云母', 'waŋ'], ['', 'wyaŋ']]],
    ['陽韻', [['幫莊組', 'aŋ'], ['', 'yaŋ']]],
    ['宕江攝', [['合口', 'waŋ'], ['', 'aŋ']]],
	// 通攝
    ['東韻 一等 影母', 'woŋ'], // 翁
    ['東冬韻 一等', 'oŋ'],
    ['鍾韻', [['脣音', 'oŋ'], ['', 'yoŋ']]],
    ['東韻 脣音', [['明母 或 舒聲','oŋ'], ['', 'uŋ']]],
    ['東韻 影母 入聲', 'wiŋ'],
    ['東韻 知影組 或 日來以母', 'iŋ'],
    ['東韻 見組 入聲', 'iŋ'],
    ['東韻', 'yuŋ'],
  ], '無韻母規則');
}

let 聲母 = 聲母規則();
let 韻母 = 韻母規則();

// == 韻尾規則 ==

var ŋ = false;

// 入聲韻尾
if (is`入聲`) {
    入聲韻尾 = {
        'm': 'fu',
        'n': 'tu',
        'ŋ': 韻母[韻母.length - 2] == 'e' ? 'ki' : 'ku'
    }
    韻母 = 韻母.slice(0, -1) + 入聲韻尾[韻母.slice(-1)]
}

// ŋ韻尾
if (韻母.endsWith('ŋ')) {
    韻母 = 韻母.slice(0, -1) + (['e', 'i'].includes(韻母[韻母.length - 2]) ? 'i': 'u');
    ŋ = true;
}

// == 韻頭規則 ==
if (韻母.startsWith('w') && is`銳音 或 支脂清韻 A類`) 韻母 = 韻母.slice(1); // 合口

// == 韻母規則 ==
if (韻母 == 'ii') 韻母 = 'yuu';

// TODO：轉假名前整理羅馬字

function 組合聲韻(聲母, 韻母) {
    if (!選項.いえ段合口 && 聲母 != '0') 韻母 = 韻母.replace('wy', 'y').replace('wi', 'i').replace('we', 'e');
    if (!選項.分mn尾 && 韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'n';
    if (!選項.p尾) 韻母 = { afu: 'au', ifu: 'yuu', efu: 'eu' }[韻母] ?? 韻母;
    if (選項.分u尾韻 == false && 韻母.endsWith('u')) 韻母 = 韻母.replace('au', 'ou').replace('iu', 'yuu').replace('eu', 'you');
    if (!選項.あお段合口 && (聲母 != '0' || 韻母[1] != 'a')) 韻母 = 韻母.replace('w', '');
    if (!選項.ぢづ && ['i', 'y'].includes(韻母[0]) && 聲母 == 'd') 聲母 = 'z';
    return [聲母, 韻母].join('');
}

function 假名化(拉丁轉寫) {
    const 五十音 = {
        '0': {'a': 'あ', 'i': 'い', 'u': 'う', 'e': 'え', 'o': 'お'},
        'k': {'a': 'か', 'i': 'き', 'u': 'く', 'e': 'け', 'o': 'こ'},
        'g': {'a': 'が', 'i': 'ぎ', 'u': 'ぐ', 'e': 'げ', 'o': 'ご'},
        's': {'a': 'さ', 'i': 'し', 'u': 'す', 'e': 'せ', 'o': 'そ'},
        'z': {'a': 'ざ', 'i': 'じ', 'u': 'ず', 'e': 'ぜ', 'o': 'ぞ'},
        't': {'a': 'た', 'i': 'ち', 'u': 'つ', 'e': 'て', 'o': 'と'},
        'd': {'a': 'だ', 'i': 'ぢ', 'u': 'づ', 'e': 'で', 'o': 'ど'},
        'n': {'a': 'な', 'i': 'に', 'u': 'ぬ', 'e': 'ね', 'o': 'の'},
        'f': {'a': 'は', 'i': 'ひ', 'u': 'ふ', 'e': 'へ', 'o': 'ほ'},
        'b': {'a': 'ば', 'i': 'び', 'u': 'ぶ', 'e': 'べ', 'o': 'ぼ'},
        'm': {'a': 'ま', 'i': 'み', 'u': 'む', 'e': 'め', 'o': 'も'},
        'y': {'a': 'や', 'i': '○', 'u': 'ゆ', 'e': 'え', 'o': 'よ'},
        'r': {'a': 'ら', 'i': 'り', 'u': 'る', 'e': 'れ', 'o': 'ろ'},
        'w': {'a': 'わ', 'i': 'ゐ', 'u': '○', 'e': 'ゑ', 'o': 'を'},
    };

    let [wi, we] = 選項.小假名ゐゑ ? ['𛅐', '𛅑'] : ['ゐ', 'ゑ'];

    const 小假名 = {
        'y': {'a': 'ゃ', 'i': '○', 'u': 'ゅ', 'e': '○', 'o': 'ょ'},
        'w': {'a': 'ゎ', 'i': wi, 'u': '○', 'e': we, 'o': '𛅒'},
    };

    if (!選項.小假名) {
        小假名['y'] = 五十音['y'];
        小假名['w'] = 五十音['w'];
    }

    // 二合拗音：wyau→𛅐ゃう
    if (拉丁轉寫.includes('wy')){
        const wy = {
            'wya': 選項.小假名ゐゑ ? '𛅐ゃ' : 'ゐや',
            'wyo': 選項.小假名ゐゑ ? '𛅐ょ' : 'ゐよ'
        }
        return `${五十音[拉丁轉寫[0]]['u']}${wy[拉丁轉寫.slice(1, 4)]}う`;
    }

    // CVVCV→CV.V.CV：見https://stackoverflow.com/a/49407494/2719898
    const 音節正則 = /[^aeiou]*[wy]?[aeioumn](?:$|[^aeiou](?=[^aeiou]))?/gi;

    音節列表 = 拉丁轉寫.match(音節正則);

    假名列表 = 音節列表.map((音節) => {
        if (音節.length == 3) {
            // CGV := CyV / CwV 
            let [C, G, V] = 音節;

            const GtoV = {
                'y': 'i',
                'w': 'u'
            };

            if (C == '0')
                return 五十音[G][V];
            if (小假名[G][V] == '○')
                return 五十音[C][V];
            if (!['k', 'g'].includes(C) && G == 'w')
                return 五十音[C][V];

            return 五十音[C][GtoV[G]] + 小假名[G][V];
        }

        const C = 音節.length == 2 ? 音節[0] : '0';
        const V = 音節.slice(-1);

        if (V.match(/[aiueo]/)) {
            return 五十音[C][V];
        } else if (V == 'n') {
            return 'ん';
        } else if (V == 'm') {
            return 'む';
        } else {
            throw new Error(`未知規則音節： ${音節}`);
        }
    })

    if (選項.小假名ŋ尾 && ŋ) {
        假名列表[假名列表.length - 1] = 假名列表[假名列表.length - 1] == 'う' ? 'ぅ' : 'ぃ'
    }

    return 假名列表.join('');
}

const 拉丁轉寫 = 組合聲韻(聲母, 韻母);

// return `${假名化(拉丁轉寫)}／${拉丁轉寫.replace('0', '')}`
return 選項.假名 ? 假名化(拉丁轉寫) : 拉丁轉寫.replace('0', '');
