/* 推導日本語漢音
 *
 * https://jgrammar.life.coocan.jp/ja/data/ksound.htm
 * https://ksu.repo.nii.ac.jp/record/1280/files/AHSUSK_HS_37_133.pdf
 * https://sozysozbot.github.io/kanzihom_taihogxeu/%E5%AF%BE%E5%BF%9C%E8%A1%A8.html
 * https://www.bilibili.com/read/cv7596219
 *
 * @author 小月の完美中文敎室
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

const sevenKeys = ['ぢづ', 'あお段合口', 'いえ段合口', '分mn尾', 'ŋ尾', 'p尾', '分u尾韻'];
if (選項.全選) sevenKeys.forEach(k => 選項[k] = true);
if (選項.全不選) sevenKeys.forEach(k => 選項[k] = false);
const keys = Object.keys(選項).filter(k => !k.startsWith('全'));
const checkedKeys = keys.filter(k => 選項[k]);
const checkedSevenKeys = checkedKeys.filter(k => sevenKeys.includes(k));

if (!音韻地位) return [
  ['ぢづ\n開：伱ぢ、づ→關：伱じ、ず', true],
  ['あお段合口\n開：瓜くゎ、わ→關：瓜か、わ', true],
  ['いえ段合口\n開：韻ゐん、遠ゑん→關：韻いん、遠えん', 選項.あお段合口 === true ? true : null],
  ['分mn尾\n開：感かむ→關：感かん', true],
  ['ŋ尾\n開：行かぅ、經けぃ→關：かう、けい', true],
  ['p尾\n開：合かふ→關：合かう', true],
  ['分u尾韻\n開：交かう、いう、えう→關：交こう、ゆう、よう', 選項.ŋ尾 === false && 選項.p尾 === false ? true : null],
  ['全選', false, { hidden: checkedSevenKeys.length === 7, reset: true }],
  ['全不選', false, { hidden: checkedSevenKeys.length === 0, reset: true }],
]

function 聲母規則() {
  return when([
    ['明母', [['梗攝 舒聲', 'm'], ['', 'b']]],
    ['脣音', 'p'],

    ['泥孃母', [['梗攝', 'n'], ['', 'd']]],
    ['來母', 'r'],
    ['舌音', 't'],

    ['日母', 'z'],
    ['齒音', 's'],

    ['疑母', 'g'],
    ['影云以母', ''],
    ['牙喉音', 'k'],
  ], '無聲母規則');
}

function 韻腹規則() {
  return when([
    // 果假攝
    ['果假攝', [['合口', 'wa'], ['一二等 或 脣音 果攝', 'a'], ['', 'ya']]],
    // 遇攝
    ['模韻', [['影母', 'wo'], ['', 'o']]],
    ['魚韻', [['莊組', 'o'], ['', 'yo']]],
    ['虞韻', [['幫莊見影組 或 來母', 'u'], ['', 'yu']]],
    // 蟹攝
    ['祭齊韻', [['合口', 'we'], ['', 'e']]],
    ['蟹攝', [['合口', 'wa'], ['', 'a']]],
    // 止攝
    ['止攝 合口', [['舌齒音', 'u'], ['牙喉音', 'wi']]],
    ['止攝', 'i'],
    // 效攝
    ['豪韻 脣音', 'o'],
    ['豪肴韻', 'a'],
    ['宵蕭韻', 'e'],
    // 流攝
    ['侯韻', 'o'],
    ['尤韻', [['明生母', 'o'], ['幫莊組', 'u'], ['', 'i']]],
    ['幽韻', 'i'],
    // 咸攝
    ['鹽嚴添韻', 'e'],
    ['咸攝', 'a'],
    // 深攝
    ['深攝', 'i'],
    // 山攝
    ['寒刪山韻', [['合口', 'wa'], ['', 'a']]],
    ['元韻 脣音', 'a'],
    ['山攝', [['合口', 'we'], ['', 'e']]],
    // 臻攝
    ['痕魂韻', 'o'],
    ['文韻', 'u'],
    ['真韻 合口 非 來母', [['莊組', 'o'], ['舌齒音', 'yu'], ['', 'wi']]],
    ['真臻殷韻', 'i'],
    // 梗攝
    ['梗攝 二等', [['合口', 'wa'], ['', 'a']]],
    ['梗攝 合口', 'we'],
    ['梗攝', 'e'],
    // 曾攝
    ['登韻', 'o'],
    ['蒸韻', [['合口 牙喉音 非 云母', 'wyo'], ['開口 莊組', 'o'], ['', 'yo']]],
    // 宕江攝
    ['陽韻 合口', [['影云母', 'wa'], ['', 'wya']]],
    ['陽韻', [['幫莊組', 'a'], ['', 'ya']]],
    ['宕江攝', [['合口', 'wa'], ['', 'a']]],
    // 通攝
    ['東韻 一等 影母', 'wo'],
    ['東冬韻 一等', 'o'],
    ['鍾韻', [['脣音', 'o'], ['', 'yo']]],
    ['東韻 入聲', [['明母', 'o'], ['脣音', 'u'], ['影母', 'wi'], ['精莊章組', 'yu'], ['', 'i']]],
    ['東韻', [['脣音', 'o'], ['', 'yu']]],
  ], '無韻腹規則');
}

function 韻尾規則() {
  return when([
    ['虞韻 知組', 'u'],
    ['蟹攝', 'i'],
    ['止攝 合口 舌齒音', 'i'],
    ['果假遇止攝', ''],
    ['效流攝', 'u'],
    ['咸深攝', [['入聲', 'pu'], ['', 'mu']]],
    ['山臻攝', [['入聲', 'tu'], ['', 'n']]],
    ['梗攝 三四等', [['入聲', 'ki'], ['', 'ŋi']]],
    ['梗曾宕江通攝', [['入聲', 'ku'], ['', 'ŋu']]],
  ], '無韻尾規則');
}

let 聲母 = 聲母規則();
let 韻腹 = 韻腹規則();
let 韻尾 = 韻尾規則();

if (韻腹[0] === 'w' && is`銳音 或 A類`) 韻腹 = 韻腹.slice(1); // 合口

// 音變規則
if (!選項.いえ段合口 && 聲母 !== '') 韻腹 = 韻腹.replace('wy', 'y').replace('wi', 'i').replace('we', 'e');
if (!選項.分mn尾 && 韻尾 === 'mu') 韻尾 = 'n';
if (!選項.ŋ尾 && 韻尾[0] === 'ŋ') 韻尾 = 韻尾.slice(1);
if (!選項.p尾 && 韻尾 === 'pu') 韻尾 = 'u';
if (選項.分u尾韻 === false && 韻尾 === 'u') 韻腹 = 韻腹.replace('a', 'o').replace('i', 'yu').replace('e', 'yo');
if (!選項.あお段合口 && (聲母 !== '' || 韻腹[1] !== 'a')) 韻腹 = 韻腹.replace('w', '');
if (!選項.ぢづ && 聲母 === 'd' && /^[iyu]/.test(韻腹[0])) 聲母 = 'z';

let 假名 = 聲母 + 韻腹;

假名 = { a: 'あ', i: 'い', u: 'う', e: 'え', o: 'お', ya: 'や', yu: 'ゆ', yo: 'よ',
  ka: 'か', ki: 'き', ku: 'く', ke: 'け', ko: 'こ', kya: 'きゃ', kyu: 'きゅ', kyo: 'きょ',
  ga: 'が', gi: 'ぎ', gu: 'ぐ', ge: 'げ', go: 'ご', gya: 'ぎゃ', gyu: 'ぎゅ', gyo: 'ぎょ',
  sa: 'さ', si: 'し', su: 'す', se: 'せ', so: 'そ', sya: 'しゃ', syu: 'しゅ', syo: 'しょ',
  za: 'ざ', zi: 'じ', zu: 'ず', ze: 'ぜ', zo: 'ぞ', zya: 'じゃ', zyu: 'じゅ', zyo: 'じょ',
  ta: 'た', ti: 'ち', tu: 'つ', te: 'て', to: 'と', tya: 'ちゃ', tyu: 'ちゅ', tyo: 'ちょ',
  da: 'だ', di: 'ぢ', du: 'づ', de: 'で', do: 'ど', dya: 'ぢゃ', dyu: 'ぢゅ', dyo: 'ぢょ',
  na: 'な', ni: 'に', nu: 'ぬ', ne: 'ね', no: 'の', nya: 'にゃ', nyu: 'にゅ', nyo: 'にょ',
  pa: 'は', pi: 'ひ', pu: 'ふ', pe: 'へ', po: 'ほ', pya: 'ひゃ', pyu: 'ひゅ', pyo: 'ひょ',
  ba: 'ば', bi: 'び', bu: 'ぶ', be: 'べ', bo: 'ぼ', bya: 'びゃ', byu: 'びゅ', byo: 'びょ',
  ma: 'ま', mi: 'み', mu: 'む', me: 'め', mo: 'も', mya: 'みゃ', myu: 'みゅ', myo: 'みょ',
  ra: 'ら', ri: 'り', ru: 'る', re: 'れ', ro: 'ろ', rya: 'りゃ', ryu: 'りゅ', ryo: 'りょ',
  wa: 'わ', wi: 'ゐ',      　   we: 'ゑ', wo: 'を', wya: 'ゐゃ',       　　   wyo: 'ゐょ',
  kwa: 'くゎ', kwi: 'く𛅐', kwe: 'く𛅑', kwo: 'く𛅒', kwya: 'く𛅐ゃ', kwyo: 'く𛅐ょ',
  gwa: 'ぐゎ', gwi: 'ぐ𛅐', gwe: 'ぐ𛅑', gwo: 'ぐ𛅒', gwya: 'ぐ𛅐ゃ', gwyo: 'ぐ𛅐ょ' }[假名] ?? 假名;

韻尾 = { i: 'い', u: 'う', mu: 'む', n: 'ん', ŋi: 'ぃ', ŋu: 'ぅ', pu: 'ふ', tu: 'つ', ki: 'き', ku: 'く' }[韻尾] ?? 韻尾;

return 假名 + 韻尾;
