/* 推導盛中唐擬音
 *
 * 中古漢語音變匯總：https://zhuanlan.zhihu.com/p/403479390
 * 本擬音是根據南北朝以來的音變，從《切韻》音系推出的。盛中唐期間的一些音變，以及擬音和記音方面的多種可能，均以選項形式列出
 *
 * 預置風格說明：
 * - 盛唐(保守)：區分BC韻、清青、咍泰；章組歸在四等，區分常船；濁上獨立
 * - 中唐 慧琳 ：不分BC韻、清青、咍泰；章組歸在四等，不分常船；濁上歸去
 * - 中唐 韻圖 ：不分BC韻、清青、咍泰；莊章合爲照組，區分常船
 *
 * 擬音依據包括：
 * - 韻圖
 * - 玄應、慧琳音義和各家反切
 * - 詩歌碑誌銘文用韻
 * - 日、韓、越漢字音
 * - 梵語、藏語、突厥語、粟特語、回鶻語譯音
 * - 關於語音不正的記載和笑話
 *
 * @author unt
 */

const is = (...x) => 音韻地位.屬於(...x);
const when = (...x) => 音韻地位.判斷(...x);

const has預置風格 = !選項.預置風格 || 選項.預置風格 !== '無';
const is盛唐 = 選項.預置風格?.includes('盛唐') ?? false;
const is中唐 = 選項.預置風格?.includes('中唐') ?? true;
const is慧琳 = 選項.預置風格?.includes('慧琳') ?? true;
const is韻圖 = 選項.預置風格?.includes('韻圖') ?? false;
const 輕唇化條件 = '幫組 東鍾微虞廢文元歌陽尤凡韻 三等 非 重紐A類';

const 非組字典 = {
  'pf': { 幫: 'pf', 滂: 'pfʰ', 並: 'bv', 明: 'mʋ' },
  'f': { 幫: 'f', 滂: 'fʰ', 並: 'v', 明: 'ɱ' }, // 微母脫鼻比非母脫塞晚很多
};
const 常船母字典 = {
  '常dʑ 船ʑ': [],
  '全ʑ': [['常船母', 'ʑ'], ['俟母', 'dʐ']], // 如果不分常船，則俟母也不獨立
  '全dʑ': [['常船母', 'dʑ'], ['俟母', 'dʐ']],
  '平dʑ 仄ʑ': [['常船母', [['平聲', 'dʑ'], ['', 'ʑ']]], ['俟母', 'dʐ']],
};

if (!音韻地位) return [
  ['預置風格', [3,
    '無',
    '盛唐（保守）',
    '中唐·慧琳反切',
    '中唐·韻圖',
  ]],

  '聲',
  ['非組', [1].concat(Object.keys(非組字典))],
  ['莊章組', has預置風格 ? null : [1,
    '莊tʂ二等 章tɕ四等',
    '莊tɕ二等 章tɕ三等', // 韻圖風格
  ]],
  ['常船母', [1].concat(Object.keys(常船母字典).slice(is慧琳 ? 1 : 0))
    .map(e => is慧琳 ? e + ' ' : e) // 加空格是爲了在切換預置風格時刷新選中的內容
  ],
  // TODO: 鼻音塞化（暫時不實現）

  '韻',
  ['二等介音', [1, '省略', 'ʕ']], // 如需其他寫法請自行修改
  ['入聲韻尾', [1, 'p t k', 'p ɾ k', 'β ɾ ɣ']],
  ['部分蟹攝二等入假攝', true],
  ['部分流攝脣音入遇攝', true],
  // ['遇攝用半高元音', true], // 模韻介於 u、o 之間，默認寫 u
  ['BC韻合流', has預置風格 ? null : true],
  ['清青合併', has預置風格 ? null : true],
  ['咍泰合併', has預置風格 ? null : true], // 盛唐可能還沒合併

  '調',
  ['聲調', [1, '五度符號', '附加符號', '調類數字']],
  ['全濁上歸去', has預置風格 && !is韻圖 ? null : true],
  '', // 在 v0.1 推導器中使「恢復預設值」按鈕位於下一行
];

選項.常船母 = 選項.常船母.trim();
if (has預置風格) {
  選項.BC韻合流 = is中唐;
  選項.清青合併 = is中唐;
  選項.咍泰合併 = is中唐;
  選項.莊章組 = is韻圖 ? '莊tɕ二等 章tɕ三等' : '莊tʂ二等 章tɕ四等';
  if (!is韻圖) 選項.全濁上歸去 = is中唐;
}

function 調整音韻地位() {
  function 調整(表達式, 調整屬性) { if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性); }
  // 輕唇化例外
  調整('明母 尤韻', { 等: '一', 韻: '侯' });
  調整('明母 東韻', { 等: '一' });

  // [慧琳反切體現的, 唐代用韻體現的, 據今音推測的]
  const 蟹攝二等入假攝字 = ['崖咼(呙)扠涯搋派差絓畫(画)罣罷(罢)', '佳鼃娃解釵(钗)卦柴', '哇洼蛙灑蝸話(话)掛挂查叉杈衩'].join('');
  const 流攝脣音入遇攝字 = ['浮戊母罦罘蜉矛茂覆懋拇某負(负)阜', '謀(谋)部畝(亩)畮婦(妇)不否桴富牟缶', '復複(复)副牡'].join('');
  if (選項.部分蟹攝二等入假攝 && 蟹攝二等入假攝字.includes(字頭)) 調整('蟹攝 二等', { 韻: '麻' });
  if (選項.部分流攝脣音入遇攝 && 流攝脣音入遇攝字.includes(字頭)) 調整('幫組 尤侯韻', { 韻: is`尤韻` ? '虞' : '模' });

  if (選項.全濁上歸去) 調整('全濁 上聲', { 聲: '去' });
}

function get聲母() {
  let 聲母 = when([
    [輕唇化條件, 非組字典[選項.非組][音韻地位.母]],
    ...常船母字典[選項.常船母],
    ['', {
      // 儘管全濁聲母在盛中唐在音值上已經弛化乃至清化，但是仍可使用濁音符號
      // 鼻音塞化也不需要寫出來，而且它只是長安音的特色
      幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
      端: 't', 透: 'tʰ', 定: 'd', 泥: 'n', 來: 'l',
      知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ',
      精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
      莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
      章: 'tɕ', 昌: 'tɕʰ', 常: 'dʑ', 書: 'ɕ', 船: 'ʑ', 日: 'ɲ', 以: 'j',
      見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ',
      影: 'ʔ', 曉: 'x', 匣: 'ɣ', 云: '',
    }[音韻地位.母]],
  ]);
  if (!選項.莊章組.includes('ʂ')) {
    聲母 = 聲母.replace('ʂ', 'ɕ').replace('ʐ', 'ʑ');
    聲母 = 聲母.replace('j', ''); // 以云也合爲喻母
  }
  return 聲母;
}

function get韻母() {
  // 下面先按中唐音推導，最後再還原回盛唐音
  const 介音字典 = {
    四開: 'i', 四合: 'y',
    三開: 'ɨ', 三合: 'ʉ',
    二開: 'ʕ', 二合: 'ʕu',
    一開: '', 一合: 'u',
  };
  const 韻基字典 = {
    // 韻核爲韻圖四等到一等
    止: { 韻核: 'i i ɹ̩ ɹ̩', 韻尾: '' },
    魚: { 韻核: 'ɯ ɯ ɯ ɯ', 韻尾: '' }, // 魚
    遇: { 韻核: 'u u u u', 韻尾: '' }, // 虞模
    假: { 韻核: 'a a a a', 韻尾: '' },
    果: { 韻核: 'ɑ ɑ ɑ ɑ', 韻尾: '' },

    曾: { 韻核: 'ɨ ɨ ə ə', 韻尾: 'ŋ' },
    通: { 韻核: 'u u o o', 韻尾: 'ŋ' }, // 東冬
    鍾: { 韻核: 'o o o o', 韻尾: 'ŋ' }, // 鍾
    梗: { 韻核: 'ɛ ɛ ɛ ɛ', 韻尾: 'ŋ' },
    江: { 韻核: 'œ œ œ œ', 韻尾: 'ŋ' },
    宕: { 韻核: 'ɑ ɑ ɑ ɑ', 韻尾: 'ŋ' },

    流: { 韻核: 'i ɨ ə ə', 韻尾: 'w' },
    效: { 韻核: 'ɛ ɛ a ʌ', 韻尾: 'w' },

    臻: { 韻核: 'i ɨ ə ə', 韻尾: 'n' },
    深: { 韻核: 'i ɨ ə ə', 韻尾: 'm' },
    蟹: { 韻核: 'ɛ ɜ a ɑ', 韻尾: 'j' },
    山: { 韻核: 'ɛ ɜ a ɑ', 韻尾: 'n' },
    咸: { 韻核: 'ɛ ɜ a ɑ', 韻尾: 'm' },
  };

  let 等 = when([
    ['精組 止攝 開口', '一'],
    ['莊組', '二'],
    ['章組 或 日母', '四'],
    ['非 三等', 音韻地位.等], // 切韻一二四等到韻圖不變

    [輕唇化條件, [
      // TODO: qieyun-js 更新後刪去元韻
      ['東韻 或 山咸攝 或 元韻', '輕'], // 介音同一等，韻核同三等
      ['止臻攝', '三'],
      ['蟹攝', '四'],
      ['', '一'],
    ]],
    // TODO: qieyun-js 更新後刪去麻清韻
    ['以母 或 重紐A類 或 鈍音 麻清韻 或 見影組 幽韻', '四'], // 鈍音切韻三 A
    ['端精組', '四'],
    ['', '三'] // 其他切韻三等到韻圖不變
  ]);
  let 介音等 = when([
    [!選項.莊章組.includes('四') && '章組 或 日母', '三'],
    [等 === '輕', '一'],
    ['', 等],
  ]);
  let 韻核等 = when([
    [等 === '三' && '臻蟹山咸攝 非 見影組 非 文韻', '四'], // 見影組以外的三 B 爲前元音
    [等 === '輕', '三'],
    ['', 等],
  ]);
  let 開合 = when([
    ['幫組', [
      ['曾通宕流效深咸攝', '開'],
      [等 === '一' || '微文韻', '合'],
      ['', '開'],
    ]],
    ['鍾韻', '合'],
    ['虞韻', '合'], // TODO: qieyun-js 更新後刪去
    ['', 音韻地位.呼 ?? '開'],
  ]);

  let 韻基 = 韻基字典[音韻地位.韻] ?? 韻基字典[is`元韻` ? '山' : 音韻地位.攝]; // TODO: qieyun-js 更新後刪去元韻
  let 介音 = 介音字典[介音等 + 開合];
  let 韻核 = 韻基.韻核.split(' ')['四三二一'.indexOf(韻核等)];
  let 韻尾 = is`舒聲` ? 韻基.韻尾 : 選項.入聲韻尾.split(' ')['mnŋ'.indexOf(韻基.韻尾)];
  if (開合 === '合' && !['ŋ', 'k'].includes(韻尾)) {
    if (等 === '四' && 韻尾) 韻核 = 韻核.replace('i', 'y');
    韻核 = 韻核.replace('ɨ', 'ʉ');
    if (等 !== '二') 韻核 = 韻核.replace('ə', 'u');
    韻核 = 韻核.replace('ɑ', is`蟹攝` ? 'ɔ' : 'ɒ');
  };
  if (介音 === 'ɨ' && 韻尾 === 'w') 韻核 = 韻核.replace('i', 'ɨ'); // 韻圖章組尤韻

  // 還原回盛唐音
  韻核 = when([
    [!選項.清青合併, [
      ['青韻', 'e'],
    ]],
    [!選項.咍泰合併, [
      ['咍灰韻', 韻核.replace('ɑ', 'ʌ')],
      ['泰韻', 'ɑ'],
    ]],
    [!選項.BC韻合流 && 等 !== '二', [
      [等 === '四' && '眞韻 合口', 'y'], // 真 B 合未被拆分，所以不包含
      ['微韻', 'ɨ'],
      ['眞韻', 'i'], // 侵韻不列入
      ['祭仙鹽韻', 'ɛ'],
    ]],
    ['', 韻核],
  ], '', true);
  if (!選項.BC韻合流 && is`微韻`) 韻尾 = 'j';

  介音 = 介音.replace(韻核, ''); // 移除重複介音
  介音 = 介音.replace('ʕ', 選項.二等介音.replace('省略', ''));
  if (選項.遇攝用半高元音) 韻核 = 韻核.replace('ɯ', 'ɤ').replace('u', 'o');
  return [介音, 韻核, 韻尾];
}

function get聲調() {
  const is陰 = is`全清 或 次清 或 次濁 上聲`;
  return {
    五度符號: is陰 ?
      { 平: '˦˨', 上: '˦˥', 去: '˧˨˦', 入: '˦' } :
      { 平: '˨˩', 上: '˨˦', 去: '˨˨˦', 入: '˨' },
    附加符號: { 平: '̀', 上: '́', 去: '̌', 入: '' },
    調類數字: { 平: '¹', 上: '²', 去: '³', 入: '⁴' },
  }[選項.聲調][音韻地位.聲];
}

function get音節() {
  const 音節 = {
    聲母: get聲母(),
    聲調: get聲調(),
  };
  [音節.介音, 音節.韻核, 音節.韻尾] = get韻母();
  音節.韻母 = 音節.介音 + 音節.韻核 + 音節.韻尾;
  音節.帶調韻母 = 選項.聲調 === '附加符號' ?
    音節.介音 + 音節.韻核 + 音節.聲調 + 音節.韻尾 :
    音節.介音 + 音節.韻核 + 音節.韻尾 + 音節.聲調;
  return 音節;
}

調整音韻地位();
const 音節 = get音節();
return 音節.聲母 + 音節.帶調韻母;
