/* 推導中唐（韻圖）擬音
 *
 * 中唐通用語以慧琳《一切經音義》反切和韻圖《韻鏡》《七音略》爲代表
 *
 * 來源：中唐音系韻基和聲類
 * https://phesoca.com/linguistics/mid-tang.png 或
 * https://t.bilibili.com/1005592182086696967 或
 * https://www.zhihu.com/pin/1725177872707268608
 *
 * @author unt
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

const 非組字典 = {
  'f': { 幫: 'f', 滂: 'fʰ', 並: 'v', 明: 'ɱ' },
  'pf': { 幫: 'pf', 滂: 'pfʰ', 並: 'bv', 明: 'ɱ' },
};

if (!音韻地位) return [
  '聲',
  ['非組', [1, ...Object.keys(非組字典)]],
  ['常船合併崇俟合併|常船合併、崇俟合併\n常 dʑ 船 ʑ 合併作擦音 ʑ\n崇 dʐ 俟 ʐ 合併作塞擦音 dʐ', true],
  ['等類記法\n選擇「三 Cˠ」時，云母寫作 ɰ\n選擇「三 Cɣ」時，匣母三四等（軟腭音）也寫作 ʁ，以免與 ɣ 衝突\n非、莊、章組後總是不寫等類記號', [1,
    { value: 'ʲ,ˠ,', text: '四 Cʲ | 三 Cˠ | 一二 C' },
    { value: 'j,ɰ,', text: '四 Cj | 三 Cɰ | 一二 C' },
    { value: 'j,ɣ̞,', text: '四 Cj | 三 Cɣ̞ | 一二 C' },
    { value: 'j,ɣ,', text: '四 Cj | 三 Cɣ | 一二 C' },
  ]],
  ['見組一二等簡寫作軟腭音', false, { text: 選項.等類記法?.includes('ɣ,') ? '見組一二等簡寫作軟腭音（匣母除外）' : null }],

  '韻',
  ['東韻及流曾攝元音', [1, 'ɨ', 'ə']],
  ['魚韻元音', [1, 'ɨ', 'ɯ']],
  ['低元音\n此外，半低元音總爲 ɛ，其前後未定，不一定是前元音', [3,
    { value: 'æ,a', text: '前 æ | 後 a' },
    { value: 'æ,ɑ', text: '前 æ | 後 ɑ' },
    { value: 'a,ɑ', text: '前 a | 後 ɑ' },
  ]],
  ['部分蟹攝二等入假攝', true],
  ['部分流攝脣音入遇攝', true],
  ['幽韻一律歸四等\n韻圖如此，但不符合實際', false],
  ['完全莊三化二\n韻圖如此，但不符合實際', false],

  '調',
  ['聲調', [2, '五度數字', '五度符號', '附加符號', '調類數字', '省略']],
  ['數字用上標', true, { hidden: !選項.聲調?.includes('數字') }],
  ['全濁上歸去', false],
];

function 調整音韻地位() {
  function 調整(表達式, 調整屬性, 字頭串 = null) {
    if (typeof (字頭串) === 'string' && !字頭串.includes(字頭)) return;
    if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性);
  }

  // 輕唇化例外
  調整('明母 尤韻', { 等: '一', 類: null, 韻: '侯' });
  調整('明母 東韻', { 等: '一', 類: null });

  if (is`云母 通攝 舒聲`) 音韻地位 = 音韻地位.調整('匣母', ['匣母三等']); // 雄熊

  // [慧琳反切體現的, 唐代用韻體現的, 據今音推測的]
  const 蟹攝二等入假攝字 = ['崖咼(呙)扠涯搋派差絓畫(画)罣罷(罢)', '佳鼃娃解釵(钗)卦柴', '哇洼蛙灑蝸話(话)掛挂查叉杈衩'].join('');
  const 流攝脣音入遇攝字 = ['浮戊母罦罘蜉矛茂覆懋拇某負(负)阜', '謀(谋)部畝(亩)畮婦(妇)不否桴富牟缶', '復複(复)副牡'].join('');
  if (選項.部分蟹攝二等入假攝 !== false) {
    調整('佳韻 合口 非 上聲', { 韻: '麻' });
    調整('蟹攝 二等', { 韻: '麻' }, 蟹攝二等入假攝字);
  }
  if (選項.部分流攝脣音入遇攝 !== false) {
    調整('幫組 尤侯韻', { 韻: is`尤韻` ? '虞' : '模' }, 流攝脣音入遇攝字);
  }
}

調整音韻地位();

const 韻圖等 = when([
  [!選項.幽韻一律歸四等 && '幽韻 B類', '三'],
  [!選項.完全莊三化二 && '莊組 三等', '三'],
  ['精組 止攝 開口', '一'],
  ['', 音韻地位.韻圖等],
]);

function get聲母() {
  let 等類記法 = 選項.等類記法.split(',');
  let 聲母 = when([
    ['幫組 C類', 非組字典[選項.非組][音韻地位.母]],
    [選項.常船合併崇俟合併 !== false && '俟母', 'dʐ'],
    [選項.常船合併崇俟合併 !== false && '常母', 'ʑ'],
    [!選項.見組一二等簡寫作軟腭音 && '見溪疑曉匣母 一二等', {
      見: 'q', 溪: 'qʰ', 疑: 'ɴ', 曉: 'χ', 匣: 'ʁ',
    }[音韻地位.母]],
    ['', {
      幫: 'p', 滂: 'pʰ', 並: 'b', 明: 'm',
      端: 't', 透: 'tʰ', 定: 'd', 泥: 'n', 來: 'l',
      知: 'ʈ', 徹: 'ʈʰ', 澄: 'ɖ', 孃: 'ɳ',
      精: 'ts', 清: 'tsʰ', 從: 'dz', 心: 's', 邪: 'z',
      莊: 'tʂ', 初: 'tʂʰ', 崇: 'dʐ', 生: 'ʂ', 俟: 'ʐ',
      章: 'tɕ', 昌: 'tɕʰ', 常: 'dʑ', 書: 'ɕ', 船: 'ʑ', 日: 'ɲ', 以: 'j',
      見: 'k', 溪: 'kʰ', 羣: 'ɡ', 疑: 'ŋ',
      影: 'ʔ', 曉: 'x', 匣: 選項.等類記法?.includes('ɣ,') ? 'ʁ' : 'ɣ', 云: '',
    }[音韻地位.母]],
  ]) + when([
    ['幫組 C類', ''],
    ['莊章組 或 日以母', ''],
    [韻圖等 === '四', 等類記法[0]],
    [韻圖等 === '三', 等類記法[1]],
    ['', 等類記法[2]],
  ]);
  聲母 = 聲母.replace(/ʰ([ʲˠ])/, '$1ʰ');
  聲母 = 聲母.replace(/^ˠ/, 'ɰ');
  return 聲母;
}

function get介音() {
  return is`合口` ? 'w' : '';
}

function get韻基() {
  let 韻基 = when([
    ['遇攝 非 開口', 'u'],
    ['遇攝', 'ɨ'],
    ['假攝', 'a'], ['果攝', 'ɑ'],

    ['止攝', 'i'], ['流攝', 'ɨw'],
    ['蟹攝', 'ɛj'], ['效攝', 'ɛw'],

    ['臻攝 (B類 合口 或 C類 非 開口)', 'un'],
    ['臻攝', 'in'], ['深攝', 'im'],
    ['山攝', 'ɛn'], ['咸攝', 'ɛm'],

    ['通攝 幫組 C類 或 鍾韻', 'uŋ'], // 鍾韻底層形式爲 /wɨwŋ/
    ['曾攝', 'ɨŋ'], ['通攝', 'ɨwŋ'],
    ['梗攝', 'ɛŋ'], ['宕攝', 'ɑŋ'], ['江攝', 'awŋ'],
  ]);
  if (韻圖等 === '一') 韻基 = 韻基.replace(/i(?=[^ŋ])/, 'ɨ');
  if (is`東韻 或 流曾攝`) 韻基 = 韻基.replace('ɨ', 選項.東韻及流曾攝元音);
  if (is`魚韻`) 韻基 = 韻基.replace('ɨ', 選項.魚韻元音);
  if (韻圖等 === '二') 韻基 = 韻基.replace(/ɛ(?=[^ŋ])/, 'a');
  if (韻圖等 === '一') 韻基 = 韻基.replace(/ɛ(?=[^ŋ])/, 'ɑ');
  韻基 = 韻基.replace('a', 選項.低元音.split(',')[0]);
  韻基 = 韻基.replace('ɑ', 選項.低元音.split(',')[1]);
  if (is`入聲`) [...'mnŋ'].forEach((v, i) => { 韻基 = 韻基.replace(v, 'ptk'[i]); });
  return 韻基;
}

function get聲調() {
  if (選項.聲調 === '省略') return '';
  const is陰 = is`全清 或 次清 或 次濁 上入聲`;
  let 聲調 = {
    五度數字: is陰 ?
      { 平: '⁴²', 上: '⁵⁵', 去: '³⁴', 入: '⁴' } :
      { 平: '²¹', 上: '²⁴', 去: '²²⁴', 入: '²' },
    五度符號: is陰 ?
      { 平: '˦˨', 上: '˥', 去: '˧˦', 入: '˦' } :
      { 平: '˨˩', 上: '˨˦', 去: '˨˨˦', 入: '˨' },
    附加符號: { 平: '̀', 上: '́', 去: '̌', 入: '' },
    調類數字: { 平: '¹', 上: '²', 去: '³', 入: '⁴' },
  }[選項.聲調][選項.全濁上歸去 && is`全濁 上聲` ? '去' : 音韻地位.聲];
  if (選項.全濁上歸去) 聲調 = 聲調.replace('²²⁴', '²⁴').replace('˨˨˦', '˨˦');
  if (選項.數字用上標 === false) 聲調 = [...聲調].map(c => '⁰¹²³⁴⁵'.indexOf(c)).join('');
  return 聲調;
}

function get音節() {
  const 音節 = {
    聲母: get聲母(),
    介音: get介音(),
    韻基: get韻基(),
    聲調: get聲調(),
  };
  if (音節.韻基[0] === 'i') 音節.聲母 = 音節.聲母.replace(/(?<!^)j/, '');
  if (音節.韻基[0] === 'u') 音節.介音 = 音節.介音.replace('w', '');
  音節.韻母 = 音節.介音 + 音節.韻基;
  音節.帶調韻基 = 選項.聲調 === '附加符號' ?
    音節.韻基[0] + 音節.聲調 + 音節.韻基.slice(1) :
    音節.韻基 + 音節.聲調;
  return 音節;
}

const 音節 = get音節();
return 音節.聲母 + 音節.介音 + 音節.帶調韻基;
