/* 推導北宋擬音（聲音唱和圖）
 *
 * 以《聲音唱和圖》和北宋中原押韻爲基礎。《聲音唱和圖》分析並記錄了北宋共通語的音系，對該圖的解析與擬音詳見：https://zhuanlan.zhihu.com/p/498778513
 *
 * 代碼注釋中的等均指韻圖等（聲音唱和圖等），而不是切韻等
 *
 * @author unt
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

const is表層 = 選項.顯示形式 !== '底層';

if (!音韻地位) return [
  ['_last顯示形式', [1, 選項.顯示形式 ?? '底層'], { hidden: true }],
  ['顯示形式|顯示\n音位分析據《聲音唱和圖》\n但止攝三四等開口 [i] 此處分析爲 /jɨj/ 而非《聲音唱和圖》中的 /jɨ/', [1,
    { value: '表層', text: '表層形式（語音實現）' },
    { value: '底層', text: '底層形式（音位形式）' },
  ]],
  '聲',
  ['知照組', [2,
    { value: 'ʃʒɹ', text: 'tɹ tʃ（通用標音習慣）' },
    { value: 'ʂʐɻ', text: 'tɻ tʂ（方言標音習慣）' },
  ]],
  ['全濁平送氣|全濁平送氣 ʰ\n《聲音唱和圖》全濁平塞音送氣，但按通常習慣可不標', true],
  ['次濁上喉化|次濁上喉化 ˀ\n《聲音唱和圖》次濁上歸陰調，但按通常習慣可不標\n喉化無標準國際音標，此處寫作上標的 ʔ，此上標字母 Unicode 未收，以 ˀ 代替', false],
  '韻',
  ['咸山攝輕脣歸\n保守：一等\n時興：二等\n（《聲音唱和圖》歸二等）', [2, '一等', '二等']],
  ['咸山蟹攝銳音一開歸\n保守：一等\n時興：二等\n（泥母蟹攝除外。《聲音唱和圖》歸二等而「乃」仍在一等）', [2, '一等', '二等']],
  ['蟹一合\n保守：/waj/ → [wɑj]\n時興：/wɨj/ → [uj]\n（《聲音唱和圖》爲 /waj/）', [2,
    { value: 'aj', text: is表層 ? 'wɑj' : 'waj' },
    { value: 'ɨj', text: is表層 ? 'uj' : 'wɨj' },
  ]],
  ['章止開\n《聲音唱和圖》和《蒙古字韻》章止開同章蟹開，但當時口語不同；《中原音韻》章止開同莊止開，但北宋時是否已經相同不明\n日母也包含在內', [2,
    // value: 等 + 韻基
    { value: '二ɨ', text: 'ɨ（同莊止開）' },
    { value: '三ɨ', text: 'jɨ（獨立）' },
    { value: '三ɨj', text: is表層 ? 'i（同章蟹開）' : 'jɨj（同章蟹開）' },
  ]],
  ['部分蟹攝二等入假攝', true],
  ['部分流攝脣音入遇攝', true],
  '調',
  ['聲調', [1, '附加符號', '調類數字', '省略']],
  ['全濁上歸去\n《聲音唱和圖》未體現全濁上字的聲調，按口語則已歸去聲，按《蒙古字韻》風格則仍算上聲', true],
];

function 調整音韻地位() {
  function 調整(表達式, 調整屬性, 字頭串 = null) {
    if (typeof (字頭串) === 'string' && !字頭串.includes(字頭)) return;
    if (is(表達式)) 音韻地位 = 音韻地位.調整(調整屬性);
  }

  // 輕唇化例外
  調整('明母 尤韻', { 等: '一', 類: null, 韻: '侯' });
  調整('明母 東韻', { 等: '一', 類: null });

  if (is`云母 通攝 舒聲`) 音韻地位 = 音韻地位.調整('匣母', ['匣母三等']); // 雄熊

  // [慧琳反切體現的, 唐代用韻體現的, 據今音推測的]
  const 蟹攝二等入假攝字 = ['崖咼(呙)扠涯搋派差絓畫(画)罣罷(罢)', '佳鼃娃解釵(钗)卦柴', '哇洼蛙灑蝸話(话)掛挂查叉杈衩'].join('');
  const 流攝脣音入遇攝字 = ['浮戊母罦罘蜉矛茂覆懋拇某負(负)阜', '謀(谋)部畝(亩)畮婦(妇)不否桴富牟缶', '復複(复)副牡'].join('');
  if (選項.部分蟹二開入假攝 !== false) {
    調整('佳韻 合口 非 上聲', { 韻: '麻' });
    調整('蟹攝 二等', { 韻: '麻' }, 蟹攝二等入假攝字);
  }
  if (選項.部分流攝脣音入遇攝 !== false) {
    調整('幫組 尤侯韻', { 韻: is`尤韻` ? '虞' : '模' }, 流攝脣音入遇攝字);
  }
}

function get聲母() {
  return when([
    ['匣母 肴韻 平聲', 'ɰ'], // 匣母“爻”在三音，但一等無字，說明“完”不是零聲母
    ['崇母 止攝 仄聲', 'ʒ'], // 崇母“士”在十音。另船母船小韻和繩小韻中“乘”聲符字今讀塞擦音，但圖中未體現，這裏不考慮

    ['幫組 C類', [
      ['幫滂母', 'f'], ['並母', 'v'], ['明母 上聲', 'ˀʋ'], ['明母', 'ʋ'], // 四音
    ]],
    ['曉母', 'x'], ['匣母', 'ɣ'], ['疑母 上聲', 'ˀŋ'], ['疑母', 'ŋ'], // 二音
    ['心母', 's'], ['邪母', 'z'], // 九音。這一組的後兩個聲母（同部位的近音）有音無字
    ['生書母', 'ʃ'], ['常母 仄聲 或 俟船母', 'ʒ'], ['日母 上聲', 'ˀɹ'], ['日母', 'ɹ'], // 十音

    ['幫母', 'p'], ['並母 仄聲', 'b'], ['滂母', 'pʰ'], ['並母', 'bʰ'], // 五音
    ['端母', 't'], ['定母 仄聲', 'd'], ['透母', 'tʰ'], ['定母', 'dʰ'], // 六音
    ['見母', 'k'], ['羣母 仄聲', 'ɡ'], ['溪母', 'kʰ'], ['羣母', 'ɡʰ'], // 一音
    ['知母', 'tɹ'], ['澄母 仄聲', 'dɹ'], ['徹母', 'tɹʰ'], ['澄母', 'dɹʰ'], // 十二音
    ['精母', 'ts'], ['從母 仄聲', 'dz'], ['清母', 'tsʰ'], ['從母', 'dzʰ'], // 八音
    ['莊章母', 'tʃ'], ['崇母 仄聲', 'dʒ'], ['初昌母', 'tʃʰ'], ['崇常母', 'dʒʰ'], // 十一音

    ['泥孃母 上聲', 'ˀn'], ['泥孃母', 'n'], ['來母 上聲', 'ˀl'], ['來母', 'l'], // 七音
    ['影母', 'ʔ'], ['云以母 上聲', 'ˀɰ'], ['云以母', 'ɰ'], ['明母 上聲', 'ˀm'], ['明母', 'm'], // 三音
  ]);
}

function get等() {
  return when([
    ['幫組 C類', [
      ['止蟹攝', '四'],
      ['咸山攝', 選項.咸山攝輕脣歸?.[0] ?? '二'],
      ['', '一'],
    ]],
    ['精組 止攝 開口', '一'], // 中唐 /sjɨ/ > /sɨ/ 變一等
    ['(章組 或 日母) 止攝 開口', 選項.章止開?.[0] ?? '三'],
    ['銳音 蟹山咸攝 一等 開口 非 (泥母 蟹攝)', 選項.咸山蟹攝銳音一開歸?.[0] ?? '二'],
    [音韻地位.韻圖等 === '四' && '銳音 非 以母', '三'], // 圖中銳音一律無四等
    ['', 音韻地位.韻圖等],
  ]);
}

function get開合() {
  return when([
    [選項.咸山攝輕脣歸 === '一等' && '咸山攝 幫組 C類', '合'],
    ['流效深咸攝', '開'], // 效攝脣音、深咸攝入聲都視爲開口，不依圖中定義
    ['幫組', [
      ['通宕攝', '開'],
      ['一等 或 虞文歌韻', '合'], // 其餘一等（包括輕脣變一等的）歸合口
      ['', '開'],
      // 圖中“八”在合口，但二等不應該在合口。這可能是繼承了《韻鏡》《七音略》脣音刪舒、山入在合口，刪入、山舒在開口。本方案不考慮
    ]],
    ['鍾虞模韻', '合'],
    ['江韻 銳音', '合'],
    ['', 音韻地位.呼 ?? '開'],
  ]);
}

function get介音(等, 開合) {
  return {
    一: { 開: '', 合: 'w' },
    二: { 開: 'ʕ', 合: 'ʕw' },
    三: { 開: 'j', 合: 'jw' },
    四: { 開: 'ʲj', 合: 'ʲjw' },
  }[等][開合];
}

function get韻基() {
  return when([
    ['遇攝', 'ɯ'], // 六聲下(僅舒聲)

    ['止攝 (章組 或 日母) 開口', 選項.章止開?.slice(1) ?? 'ɨ'],
    ['止攝 (精組 開口 或 莊組)', 'ɨ'], // 五聲上(舒)
    ['臻攝', is`入聲` ? 'ɨt' : 'ɨn'], // 五聲上(入) & 三聲下

    ['果假攝 或 佳韻 合口 非 上聲', 'a'], // 一聲上(舒)
    ['山攝', is`入聲` ? 'at' : 'an'], // 一聲上(入) & 三聲上

    ['蟹攝 一等 非 開口', 選項.蟹一合 ?? 'aj'],
    ['蟹攝 (一二等 或 莊組)', 'aj'], // 一聲下(僅舒聲)

    ['止蟹攝', 'ɨj'], // 五聲下(舒)
    ['曾梗攝', is`入聲` ? 'ɨjk' : 'ɨjŋ'], // 五聲下(入) & 二聲下

    ['流攝', 'ɨw'], // 四聲下(舒)
    ['通攝', is`入聲` ? 'ɨwk' : 'ɨwŋ'], // 四聲下(入) & 六聲上

    ['效攝', 'aw'], // 四聲上(舒)
    ['宕江攝', is`入聲` ? 'awk' : 'awŋ'], // 四聲上(入) & 二聲上

    ['深攝', is`入聲` ? 'ɨp' : 'ɨm'], // 七聲上
    ['咸攝', is`入聲` ? 'ap' : 'am'], // 七聲下
  ]);
}

function get聲調() {
  if (選項.聲調 === '省略') return '';
  let 聲調 = 音韻地位.聲;
  if (選項.全濁上歸去 && is`全濁 上聲`) 聲調 = '去';
  return {
    附加符號: ['̀', '́', '̌', ''], // 入聲已由韻尾表明，無需附加符號
    調類數字: ['¹', '²', '³', '⁴'],
  }[選項.聲調 ?? '附加符號']['平上去入'.indexOf(聲調)];
}

function 底層to表層(音節) {
  function 替換韻核(from, tos, condition = true) {
    if (!condition || 音節.韻核 !== from) return;
    音節.韻核 = 音節.介音.includes('w') ? tos.pop() : tos[0];
  }

  let is三四等 = 音節.介音.includes('j');
  let is二等 = 音節.介音.includes('ʕ');
  let is一等 = !is二等 && !is三四等;
  if (!音節.韻尾) {
    替換韻核('ɯ', ['ɯ', 'u']);
    替換韻核('a', ['ʌ'], is一等);
  } else if (音節.韻核 === 'a' && ['wk', 'wŋ'].includes(音節.韻尾)) {
    替換韻核('a', ['ɑ'], !is二等);
    音節.韻尾 = 音節.韻尾[1];
  } else {
    替換韻核('ɨ', ['i', 'y'], is三四等);
    替換韻核('ɨ', ['iˤ'], is二等 && 音節.韻尾[0] === 'j');
    替換韻核('ɨ', ['ɨ', 'u']);
    替換韻核('ɨ', ['u'], ['wk', 'wŋ'].includes(音節.韻尾));
    替換韻核('a', ['ɛ'], is三四等);
    替換韻核('a', ['ɑ'], is一等);
  }

  音節.介音 = 音節.介音.replace('jw', 'ɥ');
  [['i', 'j'], ['y', 'ɥ'], ['u', 'w']].forEach(([vowel, semivowel]) => {
    if (音節.韻核[0] === vowel) {
      音節.介音 = 音節.介音.replace(semivowel, '');
      音節.韻尾 = 音節.韻尾.replace(semivowel, '');
    }
  });
}

function 後處理(音節) {
  [...'ʃʒɹ'].forEach((e, i) => { 音節.聲母 = 音節.聲母.replace(e, 選項.知照組[i]); });
  if (is表層) 音節.介音 = 音節.介音.replace('ʕ', '');

  if (音節.介音.includes('ʲ')) {
    音節.聲母 += 'ʲ';
    音節.聲母 = 音節.聲母.replace('ʰʲ', 'ʲʰ');
    音節.介音 = 音節.介音.replace('ʲ', '');
  }
  if (is表層 && 音節.聲母.includes('ɰ')) {
    音節.聲母 = 音節.聲母.replace('ɰʲ', ''); // 韻圖四等由 j 指示
    if (音節.介音 === 'ɥ' || !音節.介音 && 音節.韻核 === 'y') 音節.聲母 = 音節.聲母.replace('ɰ', 'w');
    if (音節.介音 === 'w' || !音節.介音 && 音節.韻核 === 'u') 音節.聲母 = 音節.聲母.replace('ɰ', '');
  }
  if (選項.次濁上喉化 === false) 音節.聲母 = 音節.聲母.replace('ˀ', '');
  if (選項.全濁平送氣 === false && is`全濁`) 音節.聲母 = 音節.聲母.replace('ʰ', '');
}

function get音節() {
  const 韻基 = get韻基();
  const 音節 = {
    聲母: get聲母(),
    介音: get介音(get等(), get開合()),
    韻核: 韻基[0],
    韻尾: 韻基.substring(1),
    聲調: get聲調(),
  };
  if (is表層) 底層to表層(音節);
  後處理(音節);
  音節.韻母 = 音節.介音 + 音節.韻核 + 音節.韻尾;
  if (選項.聲調 === '調類數字') 音節.帶調韻母 = 音節.韻母 + 音節.聲調;
  else if (音節.韻核.length === 1) 音節.帶調韻母 = 音節.介音 + 音節.韻核 + 音節.聲調 + 音節.韻尾;
  else 音節.帶調韻母 = 音節.介音 + 音節.韻核[0] + 音節.聲調 + 音節.韻核.slice(1) + 音節.韻尾;
  return 音節;
}

調整音韻地位();
const 音節 = get音節();
return 音節.聲母 + 音節.帶調韻母;
