/* 推導老國音
 *
 * 音系：https://zh.wikiversity.org/zh-hant/%E8%80%81%E5%9C%8B%E9%9F%B3%E9%9F%B3%E7%B4%A0
 * 音變規則：https://zh.wikiversity.org/zh-hant/%E8%80%81%E5%9C%8B%E9%9F%B3%E8%88%87%E5%BB%A3%E9%9F%BB%E5%B0%8D%E6%AF%94
 * 字音來源：https://github.com/baopaau/rime-bepemefeve/blob/main/bepemefeve.dict.yaml
 * 注意「僞老國音」：https://www.bilibili.com/read/cv17377530/
 *
 * @author 307587
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  ['注音符號|標注方式', [2, {text: '國際音標', value: false}, {text: '注音符號', value: true}]],
  '標注風格',
  ...(選項.注音符號 !== false ? [
    ['注音符號省略陰平調號|省略陰平調號', false],
  ] : [
    ['ㄬㄭ', [2, 'ȵ ɿ ʅ', 'ɲ ɹ̩ ɻ̍']],
    ['介音', [2, { text: 'j w ɥ', value: '半元音' }, { text: 'i u y', value: '元音' }]],
    ['ㄧㄞ', [2,
      { text: 選項.介音 === '半元音' ? 'jæi' : 'iæi', value: 'iæi' },
      { text: 選項.介音 === '半元音' ? 'jai' : 'iai', value: 'iai' },
    ]],
    ['ㄨㄣ\n趙元任《國音新詩韻》：「ㄨㄣ」也可以一律照樣拼念作「ㄨㄜㄋ」，但是在「ㄉ，ㄊ，ㄋ，ㄌ；ㄗ，ㄘ，ㄙ」七個聲母後頭可以省去「ㄜ」音念「ㄨㄋ」', [2, 'un', 'uən']],
    ['喉塞|入聲標示喉塞尾', true],
  ]),
  ['聲調', [7, '調值數字（趙元任）', '調值數字（王璞）', '調值符號（趙元任）', '調值符號（王璞）', '調類數字', '調類數字（不上標）', '調符']],
  '特殊演變',
  [`匣上|匣上變去
  匣母上聲有很多字不變去聲`, true],
];

const 聲母規則 = () => when([
  ['幫滂並母 C類', 'ㄈ'],
  ['幫母 或 並母 仄聲', 'ㄅ'],
  ['滂並母', 'ㄆ'],
  ['明母', [['微韻', 'ㄪ'], ['C類 非 流通攝', ''], ['', 'ㄇ']]],

  ['端母 或 定母 仄聲', 'ㄉ'],
  ['透定母', 'ㄊ'],
  ['泥孃母', 'ㄋ'], // 細音詳後
  ['來母', 'ㄌ'],

  ['邪母 之韻 開口 平聲', 'ㄘ'], // 詞祠辭
  ['精母 或 從母 仄聲', 'ㄗ'],
  ['清從母', 'ㄘ'],
  ['心邪母', 'ㄙ'],

  ['崇母 之韻 開口', 'ㄕ'], // 士仕事
  ['知莊章母 或 澄崇母 仄聲', 'ㄓ'],
  ['徹澄初崇昌母', 'ㄔ'],
  ['常母 平聲 (尤侵真韻 或 支仙韻 合口 或 清蒸陽韻 開口)', 'ㄔ'],
  ['生俟常書船母', 'ㄕ'],
  ['日母', [['止蟹攝 開口', ''], ['', 'ㄖ']]],

  ['見母 或 羣母 仄聲', 'ㄍ'],
  ['溪羣母', 'ㄎ'],
  ['疑母', 'ㄫ'], // 細音詳後

  ['影云以母', ''],
  ['曉匣母', 'ㄏ'],
], '無聲母規則');

const 舒聲韻母規則 = () => when([
  // 果攝
  ['歌韻 一等', [['合口 非 疑母', 'ㄨㄛ'], ['', 'ㄛ']]],
  ['歌韻 三等', [['脣音', 'ㄨㄛ'], ['合口', 'ㄩㄝ'], ['', 'ㄧㄝ']]],

  // 假攝
  ['麻韻 二等', [['合口', 'ㄨㄚ'], ['牙喉音', 'ㄧㄚ'], ['', 'ㄚ']]],
  ['麻韻 三四等', 'ㄧㄝ'],

  // 遇攝
  ['模韻', 'ㄨ'],
  ['魚虞韻', 'ㄩ'],

  // 蟹攝
  ['咍灰泰韻', [['開口', 'ㄞ'], ['泰韻 合口 疑母', 'ㄨㄞ'], ['', 'ㄨㄟ']]],
  ['佳皆夬韻', [['合口', 'ㄨㄞ'], ['牙喉音', 'ㄧㄞ'], ['', 'ㄞ']]], // 佳合韻牙喉音應爲ㄨㄞ，但有不少ㄨㄚ
  ['祭廢齊韻', [['廢韻 脣音', 'ㄨㄟ'], ['廢韻 開口 銳音', 'ㄧㄞ'], ['合口', 'ㄨㄟ'], ['日母', 'ㄦ'], ['', 'ㄧ']]], // 明廢去無字；常開三祭平「栘（以開三支平ㄧˊ）」、日開三祭平「臡（只有「泥開四齊平ㄋㄧˊ」一讀）」；銳廢開「茝ㄔㄞˇ佁䑂𦚪」

  // 止攝
  ['止攝 合口', [['莊組', 'ㄨㄞ'], ['', 'ㄨㄟ']]],
  ['止攝', [['精組', 'ㄭ'], ['日母', 'ㄦ'], ['', 'ㄧ']]],  // ㄭ只用於解釋空韻，一般不寫，下同

  // 效攝
  ['宵蕭韻 或 肴韻 牙喉音', 'ㄧㄠ'],
  ['豪肴韻', 'ㄠ'],

  // 流攝
  ['侯韻', 'ㄡ'],
  ['尤韻', [['脣音', 'ㄡ'], ['', 'ㄧㄡ']]],
  ['幽韻', [['幫滂並母', 'ㄧㄠ'], ['', 'ㄧㄡ']]], // 彪

  // 咸攝
  ['鹽添韻 或 咸銜嚴韻 牙喉音', 'ㄧㄢ'],
  ['覃談咸銜嚴韻', 'ㄢ'],
  ['凡韻', 'ㄩㄢ'],

  // 深攝
  ['侵韻', 'ㄧㄣ'],

  // 山攝
  ['寒刪山韻 合口', 'ㄨㄢ'],
  ['刪山韻 牙喉音', 'ㄧㄢ'],
  ['寒刪山韻', 'ㄢ'],
  ['仙先韻', [['合口', 'ㄩㄢ'], ['', 'ㄧㄢ']]],
  ['元韻', [['開口', 'ㄧㄢ'], ['', 'ㄩㄢ']]],

  // 臻攝
  ['痕韻', 'ㄣ'],
  ['魂韻', 'ㄨㄣ'],
  ['真臻殷韻', [['合口', 'ㄩㄣ'], ['', 'ㄧㄣ']]], // 臻韻莊組會推如ㄣ，詳後
  ['文韻', 'ㄩㄣ'],

  // 梗曾攝
  ['梗曾攝 一二等', [['合口', 'ㄨㄥ'], ['', 'ㄥ']]],
  ['梗曾攝', [['合口', 'ㄩㄥ'], ['', 'ㄧㄥ']]], // 蒸合韻無舒聲但照推

  // 宕攝
  ['唐韻', [['合口', 'ㄨㄤ'], ['', 'ㄤ']]],
  ['陽韻', [['合口 或 幫莊組', 'ㄨㄤ'], ['', 'ㄧㄤ']]],

  // 江攝
  ['江韻', [['牙喉音', 'ㄧㄤ'], ['知莊組', 'ㄨㄤ'], ['', 'ㄤ']]],

  // 通攝
  ['通攝', [['三等 牙喉音', 'ㄩㄥ'], ['', 'ㄨㄥ']]],
], '無韻母規則');

const 入聲韻母規則 = () => when([
  // 咸攝
  ['覃談韻', [['牙喉音', 'ㄛ'], ['', 'ㄚ']]],
  ['咸銜韻', [['牙喉音', 'ㄧㄚ'], ['', 'ㄚ']]],
  ['鹽添韻', 'ㄧㄝ'],
  ['嚴凡韻', [['脣音', 'ㄨㄚ'], ['', 'ㄧㄝ']]],

  // 深攝
  ['侵韻', [['生母', 'ㄜ'], ['', 'ㄧ']]], // 莊組只有生母讀ㄜ

  // 山攝
  ['寒韻', [['合口', 'ㄨㄛ'], ['脣牙喉音', 'ㄛ'], ['', 'ㄚ']]],
  ['刪山韻', [['合口', 'ㄨㄚ'], ['牙喉音', 'ㄧㄚ'], ['', 'ㄚ']]],
  ['仙先韻', [['合口', 'ㄩㄝ'], ['', 'ㄧㄝ']]],
  ['元韻', [['脣音', 'ㄨㄚ'], ['合口', 'ㄩㄝ'], ['', 'ㄧㄝ']]],

  // 臻攝
  ['痕韻', 'ㄜ'],
  ['魂韻', [['脣音', 'ㄛ'], ['', 'ㄨ']]],
  ['真韻 合口', [['知生母', 'ㄨㄛ'], ['', 'ㄩ']]], // 知莊組ㄨ、ㄨㄛ兩者勢均，徹莊母多ㄨ
  ['真臻殷韻', [['生母 臻韻', 'ㄜ'], ['', 'ㄧ']]], // 莊組臻韻只有生母讀ㄜ
  ['文韻', 'ㄩ'], // 見組文韻入聲讀音預測ㄩ（如「屈ㄑㄩ˙」，溪文入）但見羣疑母多ㄩㄝ

  // 梗攝
  ['梗攝 二等', [['合口', 'ㄨㄛ'], ['', 'ㄜ']]],
  ['梗攝', [['合口', 'ㄩ'], ['', 'ㄧ']]],

  // 曾攝
  ['登韻', [['合口', 'ㄨㄛ'], ['', 'ㄜ']]],
  ['蒸韻', [['合口', 'ㄩ'], ['莊組', 'ㄜ'], ['', 'ㄧ']]],

  // 宕攝
  ['唐韻', [['合口', 'ㄨㄛ'], ['', 'ㄛ']]],
  ['陽韻', [['合口 或 幫莊組', 'ㄩㄛ'], ['', 'ㄧㄛ']]], // 明陽入無字；孃陽入無常用字；莊組開口ㄛ、ㄨㄛ兩者勢均，但對應陽聲韻今讀合口呼

  // 江攝
  ['江韻', [['牙喉音', 'ㄧㄛ'], ['知莊組', 'ㄨㄛ'], ['', 'ㄛ']]],

  // 通攝
  ['通攝', [['三等 牙喉音', 'ㄩ'], ['', 'ㄨ']]],
], '無韻母規則');

const 聲調規則 = () => when([
  ['平聲', [['清音', 'ˉ'], ['濁音', 'ˊ']]],
  ['去聲 或 上聲 全濁', 'ˋ'],
  ['上聲', 'ˇ'],
  ['入聲', '˙'],
], '無聲調規則');

let 聲母 = 聲母規則();
let 韻母 = is`舒聲` ? 舒聲韻母規則() : 入聲韻母規則();
let 聲調 = 聲調規則();

if (選項.匣上 !== true && is`匣母 上聲`) 聲調 = 'ˇ';

// 顎化；疑母齊、撮呼不規則脫鼻
if (['ㄧ', 'ㄩ'].includes(韻母[0])) 聲母 = { ㄍ: 'ㄐ', ㄎ: 'ㄑ', ㄏ: 'ㄒ' }[聲母] || 聲母;
if (['ㄧ', 'ㄩ'].includes(韻母[0]) && 聲母 === 'ㄋ' && !is`齊之韻 開口`) 聲母 = 'ㄬ';
if (韻母[0] === 'ㄧ' && 聲母 === 'ㄫ') 聲母 = is`(齊之尤蒸陽韻 非 合口) 或 (侵仙先元庚韻 入聲)` ? 'ㄬ' : '';
if (韻母[0] === 'ㄩ' && 聲母 === 'ㄫ') 聲母 = '';

// 捲舌音
if (['ㄓ', 'ㄔ', 'ㄕ', 'ㄖ'].includes(聲母)) {
  if (韻母 === 'ㄧ') 韻母 = 'ㄭ';
  if (韻母[0] === 'ㄧ' && 韻母[1]) 韻母 = 韻母.slice(1);
  if (韻母 === 'ㄩㄝ') 韻母 = 'ㄨㄛ';
  if (韻母[0] === 'ㄩ') 韻母 = 'ㄨ' + 韻母.slice(1);
}

// 脣音
if (is`脣音` && 韻母[0] === 'ㄩ') 韻母 = 'ㄨ' + 韻母.slice(1);
if (['ㄅ', 'ㄆ', 'ㄇ', 'ㄈ'].includes(聲母) && 韻母[0] === 'ㄨ' && 韻母[1] && !['ㄣ', 'ㄥ'].includes(韻母[1])) 韻母 = 韻母.slice(1);
if (['ㄈ', 'ㄪ'].includes(聲母) && 韻母[0] === 'ㄧ') 韻母 = 韻母.slice(1) || 'ㄟ';

if (聲母 === 'ㄫ' && 韻母[0] === 'ㄨ') 聲母 = ''; // 疑母合口

// IPA
if (選項.注音符號 === false) {
  聲母 = {
    ㄅ: 'p', ㄆ: 'pʰ', ㄇ: 'm', ㄈ: 'f', ㄪ: 'ʋ',
    ㄉ: 't', ㄊ: 'tʰ', ㄋ: 'n', ㄌ: 'l',
    ㄍ: 'k', ㄎ: 'kʰ', ㄫ: 'ŋ', ㄏ: 'x',
    ㄐ: 'tɕ', ㄑ: 'tɕʰ', ㄬ: 'ɲ', ㄒ: 'ɕ',
    ㄓ: 'tʂ', ㄔ: 'tʂʰ', ㄕ: 'ʂ', ㄖ: 'ɻ',
    ㄗ: 'ts', ㄘ: 'tsʰ', ㄙ: 's',
  }[聲母] || 聲母;
  韻母 = {
    ㄧ: 'i', ㄨ: 'u', ㄩ: 'y', ㄭ: ['ts', 'tsʰ', 's'].includes(聲母) ? 'ɹ̩' : 'ɻ̍',
    ㄚ: 'a', ㄛ: 'o', ㄜ: 'ə', ㄦ: 'ɚ', ㄝ: 'e',
    ㄞ: 'ai', ㄟ: 'əi', ㄠ: 'au', ㄡ: 'əu',
    ㄢ: 'an', ㄣ: 'ən', ㄤ: 'aŋ', ㄥ: 'əŋ',
    ㄧㄚ: 'ia', ㄧㄛ: 'io', ㄧㄝ: 'ie',
    ㄧㄞ: 'iai', ㄧㄠ: 'iau', ㄧㄡ: 'iəu',
    ㄧㄢ: 'iɛn', ㄧㄣ: 'in', ㄧㄤ: 'iaŋ', ㄧㄥ: 'iŋ',
    ㄨㄚ: 'ua', ㄨㄛ: 'uo', ㄨㄞ: 'uai', ㄨㄟ: 'uəi',
    ㄨㄢ: 'uan', ㄨㄣ: 'uən', ㄨㄤ: 'uaŋ', ㄨㄥ: 'oŋ',
    ㄩㄛ: 'yo', ㄩㄝ: 'ye', ㄩㄢ: 'yɛn', ㄩㄣ: 'yn', ㄩㄥ: 'ioŋ',
  }[韻母] || 韻母;

  // 音標風格
  if (選項.ㄬㄭ === 'ȵ ɿ ʅ') { // ㄬㄭ
    if (聲母 === 'ɲ') 聲母 = 'ȵ';
    if (韻母 === 'ɹ̩') 韻母 = 'ɿ';
    if (韻母 === 'ɻ̍') 韻母 = 'ʅ';
  }
  if (韻母 === 'iai') 韻母 = 選項.ㄧㄞ; // ㄧㄞ
  if (韻母 === 'uən') 韻母 = 選項.ㄨㄣ; // ㄨㄣ
  if (選項.喉塞 === true && is`入聲`) 韻母 = 韻母 + 'ʔ'; // 喉塞音韻尾
  if (選項.介音 === '半元音' && 韻母[1] && !['n', 'ŋ', 'ʔ'].includes(韻母[1])) { // 介音
    if (韻母[0] === 'i') 韻母 = 'j' + 韻母.slice(1);
    if (韻母[0] === 'u') 韻母 = 'w' + 韻母.slice(1);
    if (韻母[0] === 'y') 韻母 = 'ɥ' + 韻母.slice(1);
  }
}

if (韻母 === 'ㄭ') 韻母 = '';

聲調 = {
  '調值數字（趙元任）': { ˉ: '⁵⁵', ˊ: '³⁵', ˇ: '²¹⁴', ˋ: '⁵¹', '˙': '⁵' },
  '調值數字（王璞）': { ˉ: '⁴⁴', ˊ: '³⁵⁵', ˇ: '²¹⁴', ˋ: '⁴¹', '˙': '⁴¹' },
  '調值符號（趙元任）': { ˉ: '˥', ˊ: '˧˥', ˇ: '˨˩˦', ˋ: '˥˩', '˙': '˥' },
  '調值符號（王璞）': { ˉ: '˦', ˊ: '˧˥˥', ˇ: '˨˩˦', ˋ: '˦˩', '˙': '˦˩' },
  '調類數字（不上標）': { ˉ: '1', ˊ: '2', ˇ: '3', ˋ: '4', '˙': '5' },
  '調類數字': { ˉ: '¹', ˊ: '²', ˇ: '³', ˋ: '⁴', '˙': '⁵' },
}[選項.聲調]?.[聲調] || 聲調;
if (選項.注音符號省略陰平調號 !== false && 選項.注音符號 !== false && 聲調 === 'ˉ') 聲調 = '';

return 聲母 + 韻母 + 聲調;
