/* 推導大埔話（百侯聲）
 *
 * 音系及IPA標法見：https://zhuanlan.zhihu.com/p/349914674
 * 拼音方案見：https://zhuanlan.zhihu.com/p/350459791
 * 推導規則描述：https://zhuanlan.zhihu.com/p/392372782
 *
 * @author 以成
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

// 推導選項
if (!音韻地位) return [
  ['文白讀', [3, '文上白下', '僅白讀', '僅文讀']],
  ['音標', [1, '客家語拼音方案 (臺灣客拼)', '國際音標 (IPA)']],
  ['標調方式', [1, '數字調號', '符號調號', '數字調值', '折線調值']]
];

// 一些常量
const 平舌 = ['z', 'c', 's'];
const 翹舌 = ['zh', 'ch', 'sh', 'rh'];
const 平舌或翹舌 = 平舌.concat(翹舌);
const 輕脣 = ['f', 'v'];
const 翹舌或輕脣 = 翹舌.concat(輕脣);

function 聲母規則(白讀) {
  return when([
    [!白讀 && 'C類 幫滂並母', 'f'],
    [!白讀 && 'C類 明母', 'v'],
    ['幫母', 'b'],
    ['滂並母', 'p'],
    ['明母', 'm'],

    ['端母', 'd'],
    ['透定母', 't'],
    ['泥孃母', 'n'],
    ['來母', 'l'],

    ['知母 二等 或 精莊母', 'z'],
    ['徹澄母 二等 或 清從初崇俟母 或 邪母 (止攝 去聲 或 遇通深攝 平聲 或 流假攝)', 'c'],
    ['心邪生母', 's'],

    ['知章母', 'zh'],
    ['徹澄昌母', 'ch'],
    ['常書船母', 'sh'],

    ['見母', 'g'],
    ['溪羣母', 'k'],
    ['日疑母', 'ng'],

    ['曉母 合口 或 匣母 (合口 或 東模韻)', 'f'],
    ['曉母 三四等 或 匣母 開口 四等', 'x'],
    ['曉匣母', 'h'],

    ['影母 合口 或 云母 (止宕攝 或 遇攝 平聲) 或 以母 止攝 合口', 'v'],
    ['云母 東韻', 'x'],
    ['影母 三四等 或 云以母', 'rh'],
    ['影母', ''],
  ], '無聲母規則');
}

function 韻母規則(白讀) {
  return when([
    ['通攝', [
      ['脣音 或 一等', 'ung'],
      ['三等', 'iung'], // (>ung/翹舌_)
    ]],

    ['止攝', [
      ['脣音 微韻', 'ui'],
      ['脣音 或 開口', 'i'], // (>ii/平翹舌_) 例外: 美費 ui 知姊死四 i
      ['合口', 'ui'], // 例外: 炊吹衰睡 oi
    ]],

    ['遇攝', [
      ['一等 或 虞韻 脣音 或 知章組', 'u'], // 例外: 蜈梧吾吳午五伍 零韻母
      ['莊組', 'ii'],
      ['', 'i'], // (>ii/翹舌_)
    ]],

    ['蟹攝', [
      ['三等', [
        ['廢韻 或 合口', 白讀 ? 'oi' : 'ui'], // 例外: 脆 cioi5 歲 sei5
        ['', 'i'], // (>ii/翹舌_)
      ]],
      ['四等', [
        ['脣音 或 開口 影組', 'i'],
        ['開口', 白讀 ? 'ei' : 'i'], // 例外: 梯 toi1
        ['', 'ui'],
      ]],
      ['二等', [
        ['佳韻 合口', 'ua'], // (>a/輕脣_)
        ['合口', 'uai'], // (>ai/輕脣_)
        ['佳韻 影組', 'ei'],
        ['', 'ai'],
      ]],
      ['一等', [
        ['咍韻', 白讀 ? 'oi' : 'ai'],
        ['灰韻', 白讀 ? 'oi' : 'ui'],
        ['泰韻', [
          ['開口', 'ai'], // 例外: 蓋害 oi
          ['合口 見組', 'uai'],
          ['', 'ui'],
        ]],
      ]],
    ]],

    ['臻攝', [
      ['三等', [
        ['真韻 脣音', 'in'], // 例外: 閩敏憫 en; 密蜜 ed
        ['文韻 脣音', 'un'],
        ['見組', 白讀 ? 'iun' : 'in'],
        ['開口', 'in'], // 例外: 韌 ngiun5 瑟 sed7
        ['合口 精組', 'un'],
        ['合口', 'iun'], // (>un/翹舌_)
      ]],
      ['一等', [
        ['脣音 或 合口', 'un'],
        ['', 'en'], // 例外: 吞 tun1; 痕 fin2
      ]],
    ]],

    ['山攝', [
      ['三等', [
        ['元韻 脣音', 'an'], // 例外: 飯 on
        ['脣音 或 開口', 'ien'], // (>een/翹舌_)
        ['合口', [
          ['元韻 或 見影組', 'ien'], // 例外: 冤園遠 ien
          ['精莊組 入聲', 'ied'],
          ['', 'ion'], // (>on/翹舌_)
        ]],
      ]],
      ['四等', [
        ['脣音', 白讀 ? 'een' : 'ien'],
        ['端組 或 來母', 'een'],
        ['', 'ien'],
      ]],
      ['一二等', [
        ['脣音', 'an'],
        ['開口', [
          ['見影組 二等', 'ien'], // 例外: 限 een; 瞎 eed
          ['見影組', 'on'],
          ['', 'an'], // 例外: 餐 on
        ]],
        ['合口', [
          ['見影組', 'uan'], // (>an/輕脣_)
          ['', 'on'],
        ]],
      ]],
    ]],

    ['效攝', [
      ['三等', 'iau'], // (>au/翹舌_)
      ['四等', [
        ['端組 或 來母', 'eeu'],
        ['', 'iau'],
      ]],
      ['二等', 'au'], // (>au/翹舌_)
      ['一等', 'ou'], // 例外: 熬靠考袍 au
    ]],

    ['果假攝', [
      ['麻韻 脣音', 'a'],
      ['三等', [
        ['歌韻', 'iau'],
        ['麻韻', 'ia'], // (>a/翹舌_)
      ]],
      ['二等', [
        ['脣音 或 開口', 'a'],
        ['合口', 'ua'], // (>a/輕脣_)
      ]],
      ['一等', 'ou'],
      ['四等', 'a'], // 爹小韻
    ]],

    ['宕江攝', [
      ['三等', [
        ['脣音', 白讀 ? 'iong' : 'ong'],
        ['莊組', 'ong'],
        ['開口', 'iong'], // (>ong/翹舌_)
        ['合口', 'uong'], // (>ong/輕脣_)
      ]],
      ['一二等', [
        ['江攝 或 脣音 或 開口', 'ong'], // 例外: 窗雙 ung
        ['', 'uong'], // (>ong/輕脣_)
      ]],
    ]],

    ['梗曾攝', [
      ['三等', [
        ['曾攝', [
          ['莊組', 'en'],
          ['', 'in'],
        ]],
        ['梗攝', [
          ['清韻 或 庚韻 (脣音 或 開口)', 白讀 ? 'iang' : 'in'], // 例外: 盟省 en、碧 ed
          ['', 白讀 ? 'iung' : 'un'], // 例外: 憬 in
        ]],
      ]],
      ['四等', [
        ['端見組 或 來母', [
          ['舒聲', 'en'],
          ['入聲', 'id'],
        ]],
        ['', 白讀 ? 'iang' : 'in'], // 例外: 星 en
      ]],
      ['二等', [
        ['耕韻 或 脣音 或 開口', 白讀 ? 'ang' : 'en'], // 例外: 拼莖 in
        ['', 白讀 ? 'uang' : 'uen'], // (>白ang|文en/輕脣_)
      ]],
      ['一等', 'en'], // 例外: 國 ued
    ]],

    ['流攝', [
      ['三四等', 'iu'],
      ['一等', 'eu'],
    ]],

    ['深攝', [
      ['莊組', 'em'],
      ['', 'im'],
    ]],

    ['咸攝', [
      ['一二等 或 脣音 C類', 'am'], // 例外: 鹹 eem; 減 iam; 夾插 iab
      ['三等', 'iam'], // (>am/翹舌_)
      ['四等', [
        ['端組 或 來母', 'eem'],
        ['', 'iam'], // (>am/翹舌_) 例外: 黏驗 eem; 躡 eeb
      ]],
    ]],
  ], '無韻母規則');
}

function 聲調規則(白讀) {
  return when([
    ['清音', [
      ['平聲', '1'],
      ['上聲', '3'],
      ['去聲', '5'],
      ['入聲', '7'],
    ]],
    ['濁音', [
      ['平聲', '2'],
      ['上聲', [
        [白讀, '1'],
        ['次濁', '3'],
        ['全濁', '5'],
      ]],
      ['去聲', '5'],
      ['入聲', '8'],
    ]],
  ], '無聲調規則');
}

function 聲母處理(聲母, 韻母) {
  // 無聲母時自動補全 v
  if (聲母 === '' && 韻母.startsWith('u')) 聲母 = 'v';
  // 日母後接洪音爲 rh
  if (is`日母` && !韻母.startsWith('i')) 聲母 = 'rh';
  return 聲母;
}

function 韻母預先處理(韻母) {
  // 替換入聲韻尾
  if (is`入聲`) {
    if (韻母.endsWith('m')) 韻母 = 韻母.slice(0, -1) + 'b';
    else if (韻母.endsWith('n')) 韻母 = 韻母.slice(0, -1) + 'd';
    else if (韻母.endsWith('ng')) 韻母 = 韻母.slice(0, -2) + 'g';
  }
  return 韻母;
}

function 韻母善後處理(聲母, 韻母) {
  // 先處理 i 相關韻母
  if (is`止攝 開口` && 韻母 === 'i' && 平舌或翹舌.includes(聲母)) {
    韻母 = 'ii';
  }
  if (is`遇攝 或 祭韻 開口` && 韻母 === 'i' && 翹舌.includes(聲母)) 韻母 = 'ii';
  // 處理一般情況
  if (韻母.startsWith('ie') && 翹舌.includes(聲母)) {
    韻母 = 'ee' + 韻母.slice(2);
  }
  if (
    (
      韻母.startsWith('ia') || 韻母.startsWith('io') || 韻母.startsWith('iu') ||
      韻母.startsWith('ua') || 韻母.startsWith('ue') || 韻母.startsWith('uo')
    ) && 翹舌或輕脣.includes(聲母) &&
    韻母 !== 'iu' // iu 韻本身除外, 如: 手 shiu3
  ) {
    韻母 = 韻母.slice(1);
  }
  return 韻母;
}

// 依選項分別推導
let 白讀音 = null, 文讀音 = null;

function 根據規則推導讀音(白讀) {
  let 讀音 = {
    韻母: '',
    聲母: '',
    聲調: ''
  };
  const 聲母推導結果 = 聲母規則(白讀);
  const 韻母推導結果 = 韻母規則(白讀);
  讀音.韻母 = 韻母善後處理(聲母推導結果, 韻母預先處理(韻母推導結果));
  讀音.聲母 = 聲母處理(聲母推導結果, 讀音.韻母);
  讀音.聲調 = 聲調規則(白讀);
  return 讀音;
}

if (選項.文白讀 === '僅白讀') {
  白讀音 = 根據規則推導讀音(true);
} else if (選項.文白讀 === '僅文讀') {
  文讀音 = 根據規則推導讀音(false);
} else if (選項.文白讀 === '文上白下') {
  白讀音 = 根據規則推導讀音(true);
  文讀音 = 根據規則推導讀音(false);
}

// K++ 轉 IPA
function 客拼轉IPA(讀音) {
  const 轉換結果 = {
    韻母: '',
    聲母: '',
    聲調: ''
  };
  const 輔音韻尾正則匹配 = /(ng|n|m|[bdg])$/;
  const 首元音正則匹配 = /^(ii|i|u|[aeo][reo]?)/;
  const 轉換聲母 = {
    'm': 'm', 'n': 'n', 'ng': 'ŋ',
    'b': 'p', 'd': 't', 'g': 'k',
    'p': 'pʰ', 't': 'tʰ', 'k': 'kʰ',
    's': 's', 'sh': 'ʃ', 'x': 'ɕ',
    'z': 'ts', 'zh': 'tʃ',
    'c': 'tsʰ', 'ch': 'tʃʰ',
    'rh': 'ʒ',
    'f': 'f', 'h': 'h', 'v': 'v',
    'l': 'l', '': ''
  };
  const 轉換元音 = {
    'i': 'i', 'ii': 'ɨ', 'u': 'u',
    'oo': 'o',
    'er': 'ə',
    'e': 'ɛ', 'o': 'ɔ',
    'ee': 'æ',
    'a': 'a',
    'm': 'm̩', 'ng': 'ŋ̍'
  };
  const 轉換輔音韻尾 = {
    'm': 'm', 'n': 'n', 'ng': 'ŋ',
    'b': 'p', 'd': 't', 'g': 'k'
  };
  // 提取輔音韻尾
  let 輔音韻尾 = 讀音.韻母.match(輔音韻尾正則匹配) === null ?
    '' :
    讀音.韻母.match(輔音韻尾正則匹配)[0];
  // 提取元音們
  let 元音們 = 輔音韻尾 !== '' ? 讀音.韻母.slice(0, -輔音韻尾.length) : 讀音.韻母;
  // 預先處理：按韻尾分別處理 u、o 元音
  if (輔音韻尾 === 'ng' || 輔音韻尾 === 'g') {
    if (元音們 === 'u') {
      元音們 = 'oo';
    } else if (元音們 === 'iu') {
      元音們 = 'ioo';
    }
  }
  if (元音們 === 'ou') {
    元音們 = 'oou';
  }
  // 將元音們逐個轉換
  let 轉換後的元音們 = [];
  while (元音們.length !== 0) {
    let 當前元音 = 元音們.match(首元音正則匹配)[0];
    轉換後的元音們.push(轉換元音[當前元音]);
    元音們 = 元音們.slice(當前元音.length);
  }
  轉換後的元音們 = 轉換後的元音們.join('');
  // 轉換韻尾
  const 轉換後的輔音韻尾 = 轉換輔音韻尾[輔音韻尾];
  // 善後處理：按聲母分別處理舌尖韻母
  if (轉換後的元音們 === 'ɨ') {
    if (平舌.includes(讀音.聲母)) {
      轉換後的元音們 = 'ɿ';
    } else {
      轉換後的元音們 = 'ʅ';
    }
  }
  // 將結果拼合成韻母
  轉換結果.韻母 = 轉換後的元音們 + (輔音韻尾 !== '' ? 轉換後的輔音韻尾 : '');
  // 轉換聲母
  轉換結果.聲母 = 轉換聲母[讀音.聲母];
  // 轉換聲調
  轉換結果.聲調 = 讀音.聲調;

  return 轉換結果;
}

if (選項.音標 === '國際音標 (IPA)') {
  白讀音 = 白讀音 ? 客拼轉IPA(白讀音) : null;
  文讀音 = 文讀音 ? 客拼轉IPA(文讀音) : null;
}

// 轉換標調方式
function 轉換標調方式(讀音, 標調方式) {
  const 轉換結果 = 讀音;
  const 轉換爲符號調號 = {
    '1': 'ˊ',
    '2': 'ˇ',
    '3': '^',
    '5': 'ˋ',
    '7': '^',
    '8': 'ˋ'
  };
  const 轉換爲數字調值 = {
    '1': '⁴⁵',
    '2': '²²⁴',
    '3': '³¹',
    '5': '⁵¹',
    '7': '³²',
    '8': '⁵'
  };
  const 轉換爲折線調值 = {
    '1': '˦˥',
    '2': '˨˨˦',
    '3': '˧˩',
    '5': '˥˩',
    '7': '˧˨',
    '8': '˥'
  };
  if (標調方式 === '符號調號') {
    轉換結果.聲調 = 轉換爲符號調號[讀音.聲調];
  } else if (標調方式 === '數字調值') {
    轉換結果.聲調 = 轉換爲數字調值[讀音.聲調];
  } else if (標調方式 === '折線調值') {
    轉換結果.聲調 = 轉換爲折線調值[讀音.聲調];
  }

  return 轉換結果;
}

if (
  選項.標調方式 === '符號調號' ||
    選項.標調方式 === '數字調值' ||
    選項.標調方式 === '折線調值'
) {
  白讀音 = 白讀音 ? 轉換標調方式(白讀音, 選項.標調方式) : null;
  文讀音 = 文讀音 ? 轉換標調方式(文讀音, 選項.標調方式) : null;
}

// 返回結果
const 白讀音結果 = 白讀音 ? 白讀音.聲母 + 白讀音.韻母 + 白讀音.聲調 : null;
const 文讀音結果 = 文讀音 ? 文讀音.聲母 + 文讀音.韻母 + 文讀音.聲調 : null;
let 結果 = null;

if (選項.文白讀 === '僅白讀') {
  結果 = 白讀音結果;
} else if (選項.文白讀 === '僅文讀') {
  結果 = 文讀音結果;
} else if (選項.文白讀 === '文上白下') {
  if (文讀音結果 === 白讀音結果) {
    結果 = 文讀音結果;
  } else {
    結果 = 文讀音結果 + '\n' + 白讀音結果;
  }
}

return 結果;
