/* 推導現代中原官話之洛阳、嵩县、南陽話 (擴展拼音)
 *
 * @author 源文雨 (fumiama)
 * 
 * 參考文獻
 * 
 * [1] 徐奕昌.南阳方言概要[J].南都学坛,1982,(03):4-18.
 * [2] 丁全.南阳方言韵母说略[J].南都学坛,1995,(05):45-47+33.
 * [3] 王晓红.南阳话与普通话语音差异[J].南都学坛,1998,(01):65-67.
 * [4] 张东端.南阳话和普通话的区别[J].商丘职业技术学院学报,2006,(04):92-94.
 * [5] 姚炎嫣.南阳方言的连读变调[J].郑州航空工业管理学院学报(社会科学版),2009,28(01):68-71.DOI:10.19327/j.cnki.zuaxb.1009-1750.2009.01.019.
 * [6] 欧阳戎元.南阳方言入声今读平声——以宛西方言为例[J].南阳师范学院学报,2013,12(04):39-45+56.
 * [7] 仵兆琪.南阳方言的语流音变现象研究[D].吉林大学,2013.
 * [8] 闫克.南阳城区方言的声调格局[J].语文学刊,2019,39(01):36-39.
 * [9] 吕倩倩.嵩县（车村镇）方言语音研究[D].陕西师范大学,2021.DOI:10.27292/d.cnki.gsxfu.2021.000301.
 * [10]楚莹莹.南阳城区方言语音变异研究[D].西南交通大学,2023.DOI:10.27414/d.cnki.gxnju.2023.000487.
 * 
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

const is更多選項 = 選項.更多選項 ?? false;

if (!音韻地位) return [
  ['標調方式', [4, '數字', '附標', '調值', '五度符號']],

  ['更多選項', is更多選項],
  ...(is更多選項 ? [
    '更多選項',
    ['微母聲母', [2, 'w', 'v']], // 南陽西部區保留 v 聲母 [1]
    ['常母平聲陰聲韻聲母和船母平聲聲母', [2, 'ch', 'sh']],
  ] : []),
];

// 預調整（中古中期通語已產生的不同）
if (is`明母 尤東韻`) 音韻地位 = 音韻地位.調整(`${音韻地位.韻 === '尤' ? '侯' : 音韻地位.韻}韻 一等 不分類`);
if (is`云母 通攝 舒聲`) 音韻地位 = 音韻地位.調整('匣母', ['匣母三等']);
// TODO 蟹攝入假攝、流攝入遇攝等

// j、q、x 不列於聲母規則，之後會由「拼細音」條件得出
// 參考 表 5-1 古今声母对照表 (车村镇) [9]
const 聲母規則 = () => when([
  ['幫滂並母 C類', 'f'],
  ['幫母', 'b'],
  ['滂母', 'p'],
  ['並母', [['平聲', 'p'], ['', 'b']]],
  ['明母', [['C類', 'w'], ['', 'm']]],

  ['端母', 'd'],
  ['透母', 't'],
  ['定母', [['平聲', 't'], ['', 'd']]],
  ['泥母', 'n'],  // 南陽方音至今仍保留泥孃二母的區別, 但今非齊齒、撮口之孃母字併入泥 [1]

  ['知母', [['開口 二等', 'z'], ['', 'zh']]],
  ['徹母', [['開口 二等', 'c'], ['', 'ch']]],
  ['澄母', [['開口 二等', [['平聲', 'c'], ['', 'z']]], ['', [['平聲', 'ch'], ['', 'zh']]]]],
  ['孃母', 'gn'],

  ['精母', 'z'],
  ['清母', 'c'],
  ['從母', [['平聲', 'c'], ['', 'z']]],
  ['心邪母', 's'],

  ['章母', [['開口 止攝', 'z'], ['', 'zh']]],
  ['昌母', [['開口 止攝', 'c'], ['', 'ch']]],
  ['常船母', [['開口 止攝', 's'], ['', [['平聲', 'ch'], ['', 'sh']]]]],
  ['書母', [['開口 止攝', 's'], ['', 'sh']]],

  ['莊母', [['開口 非 宕江攝', 'z'], ['', 'zh']]],
  ['初母', [['開口', 'c'], ['合口', 'ch']]],
  ['崇母', [['開口', [['平聲', 'c'], ['', 'z']]], ['', [['平聲', 'ch'], ['', 'zh']]]]],
  ['生母', [['開口', 's'], ['', 'sh']]],
  ['俟母', [['平聲', 'c'], ['', 'z']]], // 俟母論文中未提及, 參考南京音系 https://zh.wikipedia.org/zh-cn/%E4%BF%9F%E6%AF%8D

  ['見母', 'g'],
  ['溪母', 'k'],
  ['羣母', [['平聲', 'k'], ['', 'g']]],

  ['來母', 'l'],
  ['日母', 'r'], // TODO: 開口 止攝 (如 二) 可選聲母 l-

  ['曉匣母', 'h'],
  ['疑影云以母', ''], // 某些疑影母在今開口呼前為 ɤ, 後續處理
], '無聲母規則');

// 韻母均按零聲母寫法，唯 y、w、yu 作 i、u、ü（例如用 uen、ueng 不用 un、ong），這是為了方便後面的拼寫處理。
// 舌尖前、後不圓唇元音統一寫為 ʅ, 後續再根據聲母不同處理
const 舒聲韻母規則 = () => when([
  ['果攝', [
    ['一等', [['合口 或 開口 端組', 'uɤ'], ['', 'ɤ']]], // FIXME 部分端組為 ɑ (他)
    ['三四等', [['開口', 'ie'], ['', 'üe']]]
  ]],

  ['假攝', [
    ['二等', [
      ['開口', [['非 見組', 'ɑ'], ['', 'iɑ']]],
      ['', 'uɑ'] // FIXME 部分知莊組合口字為 ɑ (傻)
    ]],
    ['三四等', 'ie']
  ]],

  ['遇攝', [
    ['一等', [['端組', 'ou'], ['', 'u']]], // FIXME 部分幫組為 uɤ (模)
    ['三四等', [['幫知章組 或 日母', 'u'], ['莊組', 'ou'], ['', 'ü']]]
  ]],

  ['蟹攝', [
    ['一二等', [
      ['開口', [['幫組', 'ei'], ['', 'ae']]], // FIXME 部分見組為 ie (介) iɑ (佳)
      ['一等', [['幫端組', 'ei'], ['', 'uei']]], // FIXME 部分端組為 uei (罪), 部分見組為 uae (外)
      ['', 'uae']]], // FIXME 部分見組為 uɑ (話)
    ['三四等', [['知章組', 'ʅ'], ['開口 或 幫組', 'i'], ['', 'uei']]]
  ]],

  ['止攝', [
    ['開口', [['幫端見組 或 泥來母', 'i'], ['日母', 'ɐ'], ['', 'ʅ']]], // FIXME 部分幫組為 ei (碑)
    // 合口
    ['幫組', 'i'], ['泥來母', 'ei'], ['莊組', 'uae'], ['', 'uei']
  ]],

  ['效攝', [
    ['一二等 非 見組', 'ɔ'],
    ['知章組 或 日母', 'ɔ'], // 三四等
    ['', 'iɔ'],
  ]],







  ['通攝', [['三四等 牙喉音', 'iong'], ['', 'ueng']]],

  ['止攝', [
    ['合口', [['莊組', 'uai'], ['', 'uei']]],
    ['', 'er'], // 'er' 指示其拼日母時為 er，以及拼 z、c、s 時聲母不作 j、q、x，其餘情形均同 i
  ]],

  ['遇攝', [['三四等', 'ü'], ['', 'u']]],

  ['蟹攝', [
    ['廢韻 平上聲 章組', [['合口', 'uai'], ['', 'ai']]], // 「茝」
    ['三四等', [['合口 莊組', 'uai'], ['合口', 'uei'], ['', 'i']]],
    // FIXME 蟹攝二等有古已轉入假攝者，依更早韻書推導時需判斷具體的字。目前暫僅列出個別可能存在系統性者
    ['二等 開口 溪影母', 'ai'], // 「矮隘楷揩」等
    ['佳韻 合口 牙喉音', 'ua'], // 「畫掛」等（FIXME 未覆蓋如「佳」「話」等，且過度覆蓋「拐」等，當依具體字而非音）
    ['佳韻 開口 疑母', 'ia'], // 「崖睚」等（FIXME 當依具體字而非音）
    ['二等', [
      ['開口 牙喉音', 'ie'],
      ['合口', 'uai'],
      ['', 'ai']],
    ],
    ['一等', [['開口', 'ai'], ['', 'uei']]],
  ]],

  ['臻深攝', [
    ['三四等', [['合口', 'ün'], ['', 'in']]],
    ['', [
      ['合口 或 舌齒音', 'uen'], // 覆蓋「吞」
      ['', 'en'],
    ]],
  ]],

  ['山咸攝', [
    ['三四等', [['合口', 'üan'], ['', 'ian']]],
    ['二等 牙喉音 開口', 'ian'],
    ['', [['合口', 'uan'], ['', 'an']]],
  ]],

  ['效攝', [
    ['三四等 或 二等 牙喉音', 'iao'],
    ['', 'ao'],
  ]],

  ['果假攝', [
    ['三四等', [['合口', 'üe'], ['', 'ie']]],
    ['二等', [['合口', 'ua'], ['牙喉音', 'ia'], ['', 'a']]],
    ['一等', [['開口 牙喉音', 'e'], ['', 'uo']]],
  ]],

  ['宕江攝', [
    ['合口 或 莊組 或 二等 知組', 'uang'],
    ['三四等 或 二等 牙喉音', 'iang'],
    ['', 'ang'],
  ]],

  ['梗曾攝', [
    ['三四等', [['合口', 'iong'], ['', 'ing']]],
    ['', [['合口', 'ueng'], ['', 'eng']]],
  ]],

  ['流攝', [
    // FIXME 流攝脣音有古已轉入遇攝者，依更早韻書推導時需判斷具體的字。目前暫僅列出個別可能存在系統性者
    ['幽韻 幫滂並母', 'iao'], // 「彪髟淲」等
    ['尤韻 脣音 非 (幫母 上聲)', 'u'], // 排除「否缶」（FIXME 當依具體字而非音）
    ['三四等', 'iou'],
    ['', 'ou'], // FIXME 未覆蓋如「牡」「部」「矛」「茂」等，當依具體字而非音
  ]],
], '無韻母規則');

const 入聲韻母規則 = () => when([
  ['通攝', [['三四等 牙喉音', 'ü'], ['', 'u']]],

  ['臻深攝', [
    ['莊組', [['合口', 'uai'], ['', 'e']]], // TODO 「櫛」？
    ['三四等', [['合口 或 脣音 C類', 'ü'], ['', 'i']]],
    ['', [['脣音', 'o'], ['合口', 'u'], ['', 'e']]],
  ]],

  ['山咸攝', [
    // TODO 「茁」
    ['二等 或 莊組 或 脣音 C類', [['合口', 'ua'], ['牙喉音', 'ia'], ['', 'a']]],
    ['三四等', [['合口', 'üe'], ['', 'ie']]],
    ['', [
      ['開口', [['牙喉音', 'e'], ['', 'a']]],
      ['', 'uo'],
    ]],
  ]],

  ['宕江攝', [
    // TODO 白讀
    ['三四等 或 二等 牙喉音', 'üe'],
    ['一等 開口 牙喉音', 'e'],
    ['', 'uo'],
  ]],

  ['梗曾攝', [
    // TODO 白讀
    ['三四等 非 莊組', [['合口', 'ü'], ['', 'i']]],
    ['', [['開口', 'e'], ['', 'uo']]],
  ]],
], '無韻母規則');

/* 參考 [1, 6]
 *
 * 中古入声字，南阳方言今概读为平声，清阴浊阳泾渭分明。这应是入声字的塞音韵尾刚刚脱落
 * 时的读法，比“入派三声”还要早一些。
 */
const 聲調規則 = () => when([
  ['清音', [
    ['平聲', '1'], // 中古清平聲字大多數演化為陰平
    ['上聲', '3'], // 中古清/次濁上多保留上聲, 全濁上歸去
    ['去聲', '4'],
    ['入聲', '1'], // 中古全濁入聲字派入陽平, 次濁/清派入陰平
  ]],
  ['濁音', [
    ['平聲', '2'], // 中古濁平聲字大多數演化為陽平
    ['上聲', [['全濁', '4'], ['次濁', '3']]], // 中古清/次濁上多保留上聲, 全濁上歸去
    ['去聲', '4'],
    ['入聲', [['全濁', '2'], ['次濁', '1']]], // 中古全濁入聲字派入陽平, 次濁/清派入陰平
  ]],
], '無聲調規則');

let 聲母 = 聲母規則();
let 韻母 = is`舒聲` ? 舒聲韻母規則() : 入聲韻母規則();
let 聲調 = 聲調規則();

if (選項.更多選項) {
  // 參考 https://www.zhihu.com/question/526195183/answer/2425807330
  if (is`(常母 陰聲韻 或 船母) 平聲`) 聲母 = 選項.常母平聲陰聲韻聲母和船母平聲聲母;
}

// j、q、x 聲母, 分尖團音 [1]
if (韻母 === 'er' || ['i', 'ü'].includes(韻母[0])) {
  聲母 = { g: 'j', k: 'q', h: 'x' }[聲母] ?? 聲母;
}

// 南陽方言 ɯ 代替了普通话中的 er [7]
if (韻母 === 'er') {
  if (聲母 === 'r') {
    聲母 = '';
    韻母 = 'ɯ';
  }
  else 韻母 = 'i';
}

// 南陽方言部分舌尖音後有開無合 [1]
if (['d', 't', 'z', 'c', 's', 'sh', 'r'].includes(聲母) && 韻母 === 'uei') 韻母 = 韻母.slice(1);

// 以下音節系統性地作開口而非合口
if (['n', 'l'].includes(聲母) && ['ua', 'uai', 'uang', 'uei'].includes(韻母)) 韻母 = 韻母.slice(1);
// 以下音節系統性地作合口而非撮口
if (韻母[0] === 'ü' && ['n', 'l'].includes(聲母) && !['ü', 'üe'].includes(韻母)) {
  韻母 = 'u' + (韻母[1] === 'n' ? 'e' : '') + 韻母.slice(1);
}

// 以下音節系統性地作洪音而非細音
if (['zh', 'ch', 'sh', 'r', 'f', 'w'].includes(聲母)) {
  if (韻母 === 'i') {
    if (聲母 === 'f' || 聲母 === 'w') 韻母 = 'ei';
  } else if (韻母[0] === 'i' || 韻母[0] === 'ü') {
    韻母 = (韻母[0] === 'ü' ? 'u' : '') + (韻母[1] === 'n' ? 'e' : '') + 韻母.slice(1);
    if (韻母 === 'ue') 韻母 = 'uo';
    else if (韻母 === 'e' && ['f', 'w'].includes(聲母)) 韻母 = 'o';
  }
}

// 以下音節系統性地作開口而非合口
if (['b', 'p', 'm', 'f', 'w'].includes(聲母) && 韻母[0] === 'u' && 韻母[1]) 韻母 = 韻母.slice(1);

// 僅今孃母齊齒/撮口字保留 gn [1]
if (聲母 === 'gn' && 韻母[0] !== 'i' && 韻母[0] !== 'ü') 聲母 = 'n';

// 今開口呼零聲母字添加聲母 ɤ [3]
if (聲母 === '' && !['i', 'u', 'ü'].includes(韻母[0])) {
  聲母 = 'ɤ';
}

// 拼音拼寫規則
if (!聲母) {
  if (韻母[0] === 'i' || 韻母[0] === 'ü') 聲母 = 'y';
  if (韻母[0] === 'u') 聲母 = 'w';
  if (聲母 && 韻母[0] !== 'ü' && 韻母[1] && 韻母[1] !== 'n') 韻母 = 韻母.slice(1);
}
韻母 = { iou: 'iu', uei: 'ui', uen: 'un', ueng: 'ong' }[韻母] || 韻母;
if (韻母[0] === 'ü' && !['n', 'l'].includes(聲母)) 韻母 = 'u' + 韻母.slice(1);

if (聲母 === 'w' && is`明母` && 選項.更多選項 && 選項.微母聲母 === 'v') {
  聲母 = 'v';
}

if (選項.標調方式 === '數字') return 聲母 + 韻母 + 聲調;
if (選項.標調方式 === '附標') return 聲母 + (聲調 ? 韻母.replace(/.*a|.*[eo]|.*[iuü]/, '$&' + ' ́̀̄̌'[聲調]) : 韻母);
if (選項.標調方式 === '調值') return 聲母 + 韻母 + ['', '24', '42', '33', '52'][聲調]; // 南陽城區, 參考 [8]
// 五度符號
return 聲母 + 韻母 + ['', '˨˦', '˦˨', '˧˧', '˥˨'][聲調]; // 南陽城區, 參考 [8]
