/* 推導日本語吳音 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [];

function 聲母規則() {
  return when([
    ['並母', 'b'],
    ['明母', 'm'],
    ['脣音', 'h'],

    ['定澄母', 'd'],
    ['泥孃日母', 'n'],
    ['來母', 'r'],
    ['舌音', 't'],

    ['齒音 濁音', 'z'],
    ['齒音', 's'],

    ['見溪曉母', 'k'],
    ['匣母 合口', 'w'],
    ['羣疑匣母', 'g'],

    ['影云以母', ''],
  ], '無聲母規則');
}

function 韻腹規則() {
  return when([
	// 果假攝
    ['果假攝', [['三等 麻韻 或 二等 舌齒音', 'ya'], ['一等', 'a'], ['', 'e']]],
	// 遇攝
    ['模韻', [['明母', 'o'], ['', 'u']]],
    ['魚韻', [['知莊章組 或 邪以日母 非 初母', 'yo'], ['', 'o']]],
    ['虞韻', [['舌音 或 日母', 'yu'], ['莊組 或 常以母', 'yu'], ['', 'u']]],

    ['蟹攝', [
      ['齊祭韻', 'e'],
      ['一等 合口 舌齒音', 'u'],
      ['一等 合口', 'e'],
      ['', 'a'],
    ]],
	// 止攝
    ['止攝', [['合口 以母', 'yu'], ['合口 舌齒音', 'u'], ['', 'i']]],
	// 效攝
    ['豪韻', 'o'],
    ['效攝', 'yo'],
	// 流攝
    ['侯韻', 'o'],
    ['流攝', 'yu'],
	// 咸攝
    ['咸攝', [
      ['入聲 一二等', 'o'],
      ['入聲 (脣音 C類 或 嚴韻 牙喉音)', 'o'],
      ['入聲 三四等', 'yo'],
      ['一二等', 'a'],
      ['脣音 C類 或 嚴韻 牙喉音', 'o'],
      ['三四等', 'e'],
    ]],
	// 深攝
    ['深攝', [['入聲','yu'], ['鈍音', 'o'], ['', 'i']]],
	// 山攝
    ['仙先韻', 'e'],
    ['山攝', 'a'],
	// 臻攝
    ['臻攝', [
      ['入聲 一等','o'],
      ['入聲 三等', [['舌齒音 合口 非 來母', 'yu'], ['C類 或 合口 非 來母', 'u'], ['', 'i']]],
      ['一等', 'o'],
      ['三等', [['舌齒音 合口 非 來母', 'yu'], ['C類 或 合口 非 來母', 'u'], ['', 'i']]],
    ]],
	// 梗攝
    ['梗攝', [
      ['入聲', 'ya'],
      ['', 'yo'],
    ]],
	// 曾攝
    ['曾攝', [
      ['入聲 一等', [['匣母 合口', 'a'], ['', 'o']]],
      ['入聲', 'yo'],
      ['一等', 'o'],
      ['精組 或 影曉母', 'o'],
      ['', 'yo'],
    ]],
	// 宕江攝
    ['宕江攝', [
      ['入聲 一二等', 'a'],
      ['入聲 三等', 'ya'],
      ['一二等', 'o'],
      ['三等', [['脣音 C類 或 開口 莊組 或 合口', 'o'], ['', 'yo']]],
    ]],
	// 通攝
    ['通攝', [
      ['入聲 一等', 'o'],
      ['入聲 C類 脣音', 'u'],
      ['入聲', 'yo'],
      ['一等', 'o'],
      ['C類', 'u'],
      ['', 'yo'],
    ]],
  ], '無韻腹規則');
}

function 韻尾規則() {
  return when([
    ['虞韻 (舌音 或 日母)', 'u'],
    ['果假遇攝', ''],
    ['蟹攝', 'i'],
    ['止攝', [['合口 銳音', 'i'], ['', '']]],
    ['效攝', 'u'],
    ['流攝', [['一等', 'u'], ['三等', '']]],
    ['咸深攝', [['入聲', 'u'], ['', 'n']]],
    ['山臻攝', [['入聲','tu'], ['', 'n']]],
    ['梗攝', [
      ['入聲 二等', 'ku'],
      ['入聲', 'ki'],
      ['二等', 'u'],
      ['', 'i'],
    ]],
    ['曾宕江通攝', [['入聲', 'ku'], ['', 'u']]],
  ], '無韻尾規則');
}

let 聲母 = 聲母規則();
let 韻腹 = 韻腹規則();
let 韻尾 = 韻尾規則();

let 假名 = 聲母 + 韻腹;

假名 = { a: 'あ', i: 'い', u: 'う', e: 'え', o: 'お', ya: 'や', yu: 'ゆ', yo: 'よ',
  ka: 'か', ki: 'き', ku: 'く', ke: 'け', ko: 'こ', kya: 'きゃ', kyu: 'きゅ', kyo: 'きょ',
  ga: 'が', gi: 'ぎ', gu: 'ぐ', ge: 'げ', go: 'ご', gya: 'ぎゃ', gyu: 'ぎゅ', gyo: 'ぎょ',
  sa: 'さ', si: 'し', su: 'す', se: 'せ', so: 'そ', sya: 'しゃ', syu: 'しゅ', syo: 'しょ',
  za: 'ざ', zi: 'じ', zu: 'ず', ze: 'ぜ', zo: 'ぞ', zya: 'じゃ', zyu: 'じゅ', zyo: 'じょ',
  ta: 'た', ti: 'ち', tu: 'つ', te: 'て', to: 'と', tya: 'ちゃ', tyu: 'ちゅ', tyo: 'ちょ',
  da: 'だ', di: 'ぢ', du: 'づ', de: 'で', do: 'ど', dya: 'ぢゃ', dyu: 'ぢゅ', dyo: 'ぢょ',
  na: 'な', ni: 'に', nu: 'ぬ', ne: 'ね', no: 'の', nya: 'にゃ', nyu: 'にゅ', nyo: 'にょ',
  ha: 'は', hi: 'ひ', hu: 'ふ', he: 'へ', ho: 'ほ', hya: 'ひゃ', hyu: 'ひゅ', hyo: 'ひょ',
  ba: 'ば', bi: 'び', bu: 'ぶ', be: 'べ', bo: 'ぼ', bya: 'びゃ', byu: 'びゅ', byo: 'びょ',
  ma: 'ま', mi: 'み', mu: 'む', me: 'め', mo: 'も', mya: 'みゃ', myu: 'みゅ', myo: 'みょ',
  ra: 'ら', ri: 'り', ru: 'る', re: 'れ', ro: 'ろ', rya: 'りゃ', ryu: 'りゅ', ryo: 'りょ',
  wa: 'わ', wi: 'ゐ',          we: 'ゑ', wo: 'を'}[假名] ?? 假名;

韻尾 = { i: 'い', u: 'う', ki: 'き', ku: 'く', ti: 'ち', tu: 'つ', n: 'ん' }[韻尾] ?? 韻尾;

let 音節 = 假名 + 韻尾;
return 音節;